MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D31.atdf
        <module name="TRNG" id="TRNG" version="6334B">
          <instance name="TRNG">
            <register-group address-space="base" name="TRNG" name-in-module="TRNG" offset="0xF8040000"/>
          </instance>
        </module>
        <module name="TWI" id="TWI" version="6212L">
          <instance name="TWI0">
            <register-group address-space="base" name="TWI0" name-in-module="TWI" offset="0xF0014000"/>
            <signals>
              <signal pad="PA31" function="A" group="TWCK" index="0"/>
              <signal pad="PA30" function="A" group="TWD" index="0"/>
            </signals>
          </instance>
          <instance name="TWI1">
            <register-group address-space="base" name="TWI1" name-in-module="TWI" offset="0xF0018000"/>
            <signals>
              <signal pad="PC27" function="B" group="TWCK" index="1"/>
              <signal pad="PC26" function="B" group="TWD" index="1"/>
            </signals>
          </instance>
          <instance name="TWI2">
            <register-group address-space="base" name="TWI2" name-in-module="TWI" offset="0xF801C000"/>
            <signals>
              <signal pad="PA19" function="B" group="TWCK" index="2"/>
              <signal pad="PA18" function="B" group="TWD" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="UART" id="UART" version="6418E">
          <instance name="UART0">
            <register-group address-space="base" name="UART0" name-in-module="UART" offset="0xF0024000"/>
            <signals>
              <signal pad="PC29" function="A" group="URXD" index="0"/>
              <signal pad="PC30" function="A" group="UTXD" index="0"/>
            </signals>
          </instance>
          <instance name="UART1">
            <register-group address-space="base" name="UART1" name-in-module="UART" offset="0xF8028000"/>
            <signals>
              <signal pad="PA30" function="B" group="URXD" index="1"/>
              <signal pad="PA31" function="B" group="UTXD" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="UDPHS" id="UDPHS" version="6227N">
          <instance name="UDPHS">
            <register-group address-space="base" name="UDPHS" name-in-module="UDPHS" offset="0xF8030000"/>
          </instance>
        </module>
        <module name="USART" id="USART" version="6089Y">
          <instance name="USART0">
            <register-group address-space="base" name="USART0" name-in-module="USART" offset="0xF001C000"/>
            <signals>
              <signal pad="PD15" function="A" group="CTS" index="0"/>
              <signal pad="PD16" function="A" group="RTS" index="0"/>
              <signal pad="PD17" function="A" group="RXD" index="0"/>
              <signal pad="PD14" function="A" group="SCK" index="0"/>
              <signal pad="PD18" function="A" group="TXD" index="0"/>
            </signals>
          </instance>
          <instance name="USART1">
            <register-group address-space="base" name="USART1" name-in-module="USART" offset="0xF0020000"/>
            <signals>
              <signal pad="PB26" function="A" group="CTS" index="1"/>
              <signal pad="PB27" function="A" group="RTS" index="1"/>
              <signal pad="PB28" function="A" group="RXD" index="1"/>
              <signal pad="PB25" function="A" group="SCK" index="1"/>
              <signal pad="PB29" function="A" group="TXD" index="1"/>
            </signals>
          </instance>
          <instance name="USART2">
            <register-group address-space="base" name="USART2" name-in-module="USART" offset="0xF8020000"/>
            <signals>
              <signal pad="PE23" function="B" group="CTS" index="2"/>
              <signal pad="PE24" function="B" group="RTS" index="2"/>
              <signal pad="PE25" function="B" group="RXD" index="2"/>
              <signal pad="PE20" function="B" group="SCK" index="2"/>
              <signal pad="PE26" function="B" group="TXD" index="2"/>
            </signals>
          </instance>
          <instance name="USART3">
            <register-group address-space="base" name="USART3" name-in-module="USART" offset="0xF8024000"/>
            <signals>
              <signal pad="PE16" function="B" group="CTS" index="3"/>
              <signal pad="PE17" function="B" group="RTS" index="3"/>
              <signal pad="PE18" function="B" group="RXD" index="3"/>
              <signal pad="PE15" function="B" group="SCK" index="3"/>
              <signal pad="PE19" function="B" group="TXD" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="WDT" id="WDT" version="6080C">
          <instance name="WDT">
            <register-group address-space="base" name="WDT" name-in-module="WDT" offset="0xFFFFFE40"/>
          </instance>
        </module>
      </peripherals>
      <interfaces>
        <interface type="samjtag" name="JTAG"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x05B3103F"/>
          <property name="CHIPID_CIDR" value="0x8A5C07C1"/>
          <property name="CHIPID_EXID" value="0x00444300"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module caption="Analog-to-digital Converter" name="ADC" version="6489J">
      <register-group name="ADC">
        <register caption="Control Register" name="ADC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
          <bitfield caption="Start Conversion" mask="0x00000002" name="START"/>
          <bitfield caption="Touchscreen Calibration" mask="0x00000004" name="TSCALIB"/>
          <bitfield caption="Automatic Calibration of ADC" mask="0x00000008" name="AUTOCAL"/>
        </register>
        <register caption="Mode Register" name="ADC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Trigger Selection" mask="0x0000000E" name="TRGSEL" values="ADC_MR__TRGSEL"/>
          <bitfield caption="Resolution" mask="0x00000010" name="LOWRES" values="ADC_MR__LOWRES"/>
          <bitfield caption="Sleep Mode" mask="0x00000020" name="SLEEP" values="ADC_MR__SLEEP"/>
          <bitfield caption="Fast Wake Up" mask="0x00000040" name="FWUP" values="ADC_MR__FWUP"/>
          <bitfield caption="Prescaler Rate Selection" mask="0x0000FF00" name="PRESCAL"/>
          <bitfield caption="Start Up Time" mask="0x000F0000" name="STARTUP" values="ADC_MR__STARTUP"/>
          <bitfield caption="Analog Settling Time" mask="0x00300000" name="SETTLING" values="ADC_MR__SETTLING"/>
          <bitfield caption="Analog Change" mask="0x00800000" name="ANACH" values="ADC_MR__ANACH"/>
          <bitfield caption="Tracking Time" mask="0x0F000000" name="TRACKTIM"/>
          <bitfield caption="Use Sequence Enable" mask="0x80000000" name="USEQ" values="ADC_MR__USEQ"/>
        </register>
