MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D31.atdf
        <register caption="Interrupt Enable Command Register" name="AIC_IECR" offset="0x40" rw="W" size="4">
          <bitfield caption="Interrupt Enable" mask="0x00000001" name="INTEN"/>
        </register>
        <register caption="Interrupt Disable Command Register" name="AIC_IDCR" offset="0x44" rw="W" size="4">
          <bitfield caption="Interrupt Disable" mask="0x00000001" name="INTD"/>
        </register>
        <register caption="Interrupt Clear Command Register" name="AIC_ICCR" offset="0x48" rw="W" size="4">
          <bitfield caption="Interrupt Clear" mask="0x00000001" name="INTCLR"/>
        </register>
        <register caption="Interrupt Set Command Register" name="AIC_ISCR" offset="0x4C" rw="W" size="4">
          <bitfield caption="Interrupt Set" mask="0x00000001" name="INTSET"/>
        </register>
        <register caption="Fast Forcing Enable Register" name="AIC_FFER" offset="0x50" rw="W" size="4">
          <bitfield caption="Fast Forcing Enable" mask="0x00000001" name="FFEN"/>
        </register>
        <register caption="Fast Forcing Disable Register" name="AIC_FFDR" offset="0x54" rw="W" size="4">
          <bitfield caption="Fast Forcing Disable" mask="0x00000001" name="FFDIS"/>
        </register>
        <register caption="Fast Forcing Status Register" name="AIC_FFSR" offset="0x58" rw="R" size="4">
          <bitfield caption="Fast Forcing Status" mask="0x00000001" name="FFS"/>
        </register>
        <register caption="Debug Control Register" name="AIC_DCR" offset="0x6C" rw="RW" size="4">
          <bitfield caption="Protection Mode" mask="0x00000001" name="PROT"/>
          <bitfield caption="General Mask" mask="0x00000002" name="GMSK"/>
        </register>
        <register caption="Write Protect Mode Register" name="AIC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY"/>
        </register>
        <register caption="Write Protect Status Register" name="AIC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="AIC_SMR__SRCTYPE">
        <value caption="High level Sensitive for internal sourceLow level Sensitive for external source" name="INT_LEVEL_SENSITIVE" value="0x0"/>
        <value caption="Positive edge triggered for internal sourceNegative edge triggered for external source" name="INT_EDGE_TRIGGERED" value="0x1"/>
        <value caption="High level Sensitive for internal sourceHigh level Sensitive for external source" name="EXT_HIGH_LEVEL" value="0x2"/>
        <value caption="Positive edge triggered for internal sourcePositive edge triggered for external source" name="EXT_POSITIVE_EDGE" value="0x3"/>
      </value-group>
    </module>
    <module caption="AXI MATRIX" name="AXIMX" version="11103A">
      <register-group name="AXIMX">
        <register caption="Remap Register" name="AXIMX_REMAP" offset="0x00" rw="W" size="4">
          <bitfield caption="Remap State 0" mask="0x00000001" name="REMAP0"/>
          <bitfield caption="Remap State 1" mask="0x00000002" name="REMAP1"/>
        </register>
        <register caption="Peripheral ID Register 4" name="AXIMX_PERIPH_ID4" offset="0x1FD0" rw="R" size="4">
          <bitfield caption="Peripheral ID" mask="0x000000FF" name="ID" values="AXIMX_PERIPH_ID4__ID"/>
        </register>
        <register caption="Peripheral ID Register 5" name="AXIMX_PERIPH_ID5" offset="0x1FD4" rw="R" size="4">
          <bitfield caption="Peripheral ID" mask="0x000000FF" name="ID" values="AXIMX_PERIPH_ID5__ID"/>
        </register>
        <register caption="Peripheral ID Register 6" name="AXIMX_PERIPH_ID6" offset="0x1FD8" rw="R" size="4">
          <bitfield caption="Peripheral ID" mask="0x000000FF" name="ID" values="AXIMX_PERIPH_ID6__ID"/>
        </register>
        <register caption="Peripheral ID Register 7" name="AXIMX_PERIPH_ID7" offset="0x1FDC" rw="R" size="4">
          <bitfield caption="Peripheral ID" mask="0x000000FF" name="ID" values="AXIMX_PERIPH_ID7__ID"/>
        </register>
        <register caption="Peripheral ID Register 0" name="AXIMX_PERIPH_ID0" offset="0x1FE0" rw="R" size="4">
          <bitfield caption="Peripheral ID" mask="0x000000FF" name="ID" values="AXIMX_PERIPH_ID0__ID"/>
        </register>
        <register caption="Peripheral ID Register 1" name="AXIMX_PERIPH_ID1" offset="0x1FE4" rw="R" size="4">
          <bitfield caption="Peripheral ID" mask="0x000000FF" name="ID" values="AXIMX_PERIPH_ID1__ID"/>
        </register>
        <register caption="Peripheral ID Register 2" name="AXIMX_PERIPH_ID2" offset="0x1FE8" rw="R" size="4">
          <bitfield caption="Peripheral ID" mask="0x000000FF" name="ID" values="AXIMX_PERIPH_ID2__ID"/>
        </register>
        <register caption="Peripheral ID Register 3" name="AXIMX_PERIPH_ID3" offset="0x1FEC" rw="R" size="4">
          <bitfield caption="Peripheral ID" mask="0x000000FF" name="ID" values="AXIMX_PERIPH_ID3__ID"/>
        </register>
        <register caption="Component ID Register 0" name="AXIMX_COMP_ID0" offset="0x1FF0" rw="R" size="4">
          <bitfield caption="Component ID" mask="0x000000FF" name="ID"/>
        </register>
        <register caption="Component ID Register 1" name="AXIMX_COMP_ID1" offset="0x1FF4" rw="R" size="4">
          <bitfield caption="Component ID" mask="0x000000FF" name="ID"/>
        </register>
        <register caption="Component ID Register 2" name="AXIMX_COMP_ID2" offset="0x1FF8" rw="R" size="4">
          <bitfield caption="Component ID" mask="0x000000FF" name="ID"/>
        </register>
        <register caption="Component ID Register 3" name="AXIMX_COMP_ID3" offset="0x1FFC" rw="R" size="4">
          <bitfield caption="Component ID" mask="0x000000FF" name="ID"/>
        </register>
        <register caption="AMIB3 Bus Matrix Functionality Modification Register" name="AXIMX_AMIB3_FN_MOD_BM_ISS" offset="0x5008" rw="RW" size="4">
          <bitfield caption="Read Issuing" mask="0x00000001" name="RD_ISS"/>
          <bitfield caption="Write Issuing" mask="0x00000002" name="WR_ISS"/>
        </register>
        <register caption="AMIB3 Bypass Merge" name="AXIMX_AMIB3_FN_MOD2" offset="0x5024" rw="RW" size="4">
          <bitfield caption="Bypass Merge" mask="0x00000001" name="BP_MRG"/>
        </register>
