MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D31.atdf
        <register caption="DMAC Channel Handler Status Register" name="DMAC_CHSR" offset="0x030" rw="R" size="4">
          <bitfield caption="Enable [7:0]" mask="0x00000001" name="ENA0"/>
          <bitfield caption="Enable [7:0]" mask="0x00000002" name="ENA1"/>
          <bitfield caption="Enable [7:0]" mask="0x00000004" name="ENA2"/>
          <bitfield caption="Enable [7:0]" mask="0x00000008" name="ENA3"/>
          <bitfield caption="Enable [7:0]" mask="0x00000010" name="ENA4"/>
          <bitfield caption="Enable [7:0]" mask="0x00000020" name="ENA5"/>
          <bitfield caption="Enable [7:0]" mask="0x00000040" name="ENA6"/>
          <bitfield caption="Enable [7:0]" mask="0x00000080" name="ENA7"/>
          <bitfield caption="Suspend [7:0]" mask="0x00000100" name="SUSP0"/>
          <bitfield caption="Suspend [7:0]" mask="0x00000200" name="SUSP1"/>
          <bitfield caption="Suspend [7:0]" mask="0x00000400" name="SUSP2"/>
          <bitfield caption="Suspend [7:0]" mask="0x00000800" name="SUSP3"/>
          <bitfield caption="Suspend [7:0]" mask="0x00001000" name="SUSP4"/>
          <bitfield caption="Suspend [7:0]" mask="0x00002000" name="SUSP5"/>
          <bitfield caption="Suspend [7:0]" mask="0x00004000" name="SUSP6"/>
          <bitfield caption="Suspend [7:0]" mask="0x00008000" name="SUSP7"/>
          <bitfield caption="Empty [7:0]" mask="0x00010000" name="EMPT0"/>
          <bitfield caption="Empty [7:0]" mask="0x00020000" name="EMPT1"/>
          <bitfield caption="Empty [7:0]" mask="0x00040000" name="EMPT2"/>
          <bitfield caption="Empty [7:0]" mask="0x00080000" name="EMPT3"/>
          <bitfield caption="Empty [7:0]" mask="0x00100000" name="EMPT4"/>
          <bitfield caption="Empty [7:0]" mask="0x00200000" name="EMPT5"/>
          <bitfield caption="Empty [7:0]" mask="0x00400000" name="EMPT6"/>
          <bitfield caption="Empty [7:0]" mask="0x00800000" name="EMPT7"/>
          <bitfield caption="Stalled [7:0]" mask="0x01000000" name="STAL0"/>
          <bitfield caption="Stalled [7:0]" mask="0x02000000" name="STAL1"/>
          <bitfield caption="Stalled [7:0]" mask="0x04000000" name="STAL2"/>
          <bitfield caption="Stalled [7:0]" mask="0x08000000" name="STAL3"/>
          <bitfield caption="Stalled [7:0]" mask="0x10000000" name="STAL4"/>
          <bitfield caption="Stalled [7:0]" mask="0x20000000" name="STAL5"/>
          <bitfield caption="Stalled [7:0]" mask="0x40000000" name="STAL6"/>
          <bitfield caption="Stalled [7:0]" mask="0x80000000" name="STAL7"/>
        </register>
        <register caption="DMAC Channel Source Address Register (ch_num = 0)" name="DMAC_SADDR0" offset="0x3C" rw="RW" size="4">
          <bitfield caption="Channel x Source Address" mask="0xFFFFFFFF" name="SADDR"/>
        </register>
        <register caption="DMAC Channel Destination Address Register (ch_num = 0)" name="DMAC_DADDR0" offset="0x40" rw="RW" size="4">
          <bitfield caption="Channel x Destination Address" mask="0xFFFFFFFF" name="DADDR"/>
        </register>
        <register caption="DMAC Channel Descriptor Address Register (ch_num = 0)" name="DMAC_DSCR0" offset="0x44" rw="RW" size="4">
          <bitfield caption="" mask="0x00000003" name="DSCR_IF" values="DMAC_DSCR0__DSCR_IF"/>
          <bitfield caption="Buffer Transfer Descriptor Address" mask="0xFFFFFFFC" name="DSCR"/>
        </register>
        <register caption="DMAC Channel Control A Register (ch_num = 0)" name="DMAC_CTRLA0" offset="0x48" rw="RW" size="4">
          <bitfield caption="Buffer Transfer Size" mask="0x0000FFFF" name="BTSIZE"/>
          <bitfield caption="Source Chunk Transfer Size." mask="0x00070000" name="SCSIZE" values="DMAC_CTRLA0__SCSIZE"/>
          <bitfield caption="Destination Chunk Transfer Size" mask="0x00700000" name="DCSIZE" values="DMAC_CTRLA0__DCSIZE"/>
          <bitfield caption="Transfer Width for the Source" mask="0x03000000" name="SRC_WIDTH" values="DMAC_CTRLA0__SRC_WIDTH"/>
          <bitfield caption="Transfer Width for the Destination" mask="0x30000000" name="DST_WIDTH" values="DMAC_CTRLA0__DST_WIDTH"/>
          <bitfield caption="" mask="0x80000000" name="DONE"/>
        </register>
        <register caption="DMAC Channel Control B Register (ch_num = 0)" name="DMAC_CTRLB0" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Source Interface Selection Field" mask="0x00000003" name="SIF" values="DMAC_CTRLB0__SIF"/>
          <bitfield caption="Destination Interface Selection Field" mask="0x00000030" name="DIF" values="DMAC_CTRLB0__DIF"/>
          <bitfield caption="Source Picture-in-Picture Mode" mask="0x00000100" name="SRC_PIP" values="DMAC_CTRLB0__SRC_PIP"/>
          <bitfield caption="Destination Picture-in-Picture Mode" mask="0x00001000" name="DST_PIP" values="DMAC_CTRLB0__DST_PIP"/>
          <bitfield caption="Source Address Descriptor" mask="0x00010000" name="SRC_DSCR" values="DMAC_CTRLB0__SRC_DSCR"/>
          <bitfield caption="Destination Address Descriptor" mask="0x00100000" name="DST_DSCR" values="DMAC_CTRLB0__DST_DSCR"/>
          <bitfield caption="Flow Control" mask="0x00E00000" name="FC" values="DMAC_CTRLB0__FC"/>
          <bitfield caption="Incrementing, Decrementing or Fixed Address for the Source" mask="0x03000000" name="SRC_INCR" values="DMAC_CTRLB0__SRC_INCR"/>
          <bitfield caption="Incrementing, Decrementing or Fixed Address for the Destination" mask="0x30000000" name="DST_INCR" values="DMAC_CTRLB0__DST_INCR"/>
          <bitfield caption="" mask="0x40000000" name="IEN"/>
          <bitfield caption="Automatic Multiple Buffer Transfer" mask="0x80000000" name="AUTO" values="DMAC_CTRLB0__AUTO"/>
        </register>
        <register caption="DMAC Channel Configuration Register (ch_num = 0)" name="DMAC_CFG0" offset="0x50" rw="RW" size="4">
          <bitfield caption="Source with Peripheral identifier" mask="0x0000000F" name="SRC_PER"/>
          <bitfield caption="Destination with Peripheral identifier" mask="0x000000F0" name="DST_PER"/>
          <bitfield caption="Source Reloaded from Previous" mask="0x00000100" name="SRC_REP" values="DMAC_CFG0__SRC_REP"/>
          <bitfield caption="Software or Hardware Selection for the Source" mask="0x00000200" name="SRC_H2SEL" values="DMAC_CFG0__SRC_H2SEL"/>
          <bitfield caption="SRC_PER Most Significant Bits" mask="0x00000C00" name="SRC_PER_MSB"/>
          <bitfield caption="Destination Reloaded from Previous" mask="0x00001000" name="DST_REP" values="DMAC_CFG0__DST_REP"/>
          <bitfield caption="Software or Hardware Selection for the Destination" mask="0x00002000" name="DST_H2SEL" values="DMAC_CFG0__DST_H2SEL"/>
          <bitfield caption="DST_PER Most Significant Bits" mask="0x0000C000" name="DST_PER_MSB"/>
          <bitfield caption="Stop On Done" mask="0x00010000" name="SOD" values="DMAC_CFG0__SOD"/>
          <bitfield caption="Interface Lock" mask="0x00100000" name="LOCK_IF" values="DMAC_CFG0__LOCK_IF"/>
          <bitfield caption="Bus Lock" mask="0x00200000" name="LOCK_B" values="DMAC_CFG0__LOCK_B"/>
          <bitfield caption="Master Interface Arbiter Lock" mask="0x00400000" name="LOCK_IF_L" values="DMAC_CFG0__LOCK_IF_L"/>
          <bitfield caption="AHB Protection" mask="0x07000000" name="AHB_PROT"/>
          <bitfield caption="FIFO Configuration" mask="0x30000000" name="FIFOCFG" values="DMAC_CFG0__FIFOCFG"/>
        </register>
        <register caption="DMAC Channel Source Picture-in-Picture Configuration Register (ch_num = 0)" name="DMAC_SPIP0" offset="0x54" rw="RW" size="4">
          <bitfield caption="Source Picture-in-Picture Hole" mask="0x0000FFFF" name="SPIP_HOLE"/>
          <bitfield caption="Source Picture-in-Picture Boundary" mask="0x03FF0000" name="SPIP_BOUNDARY"/>
        </register>
