MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D31.atdf
      <value-group caption="" name="DMAC_CFG2__FIFOCFG">
        <value caption="The largest defined length AHB burst is performed on the destination AHB interface." name="ALAP_CFG" value="0x0"/>
        <value caption="When half FIFO size is available/filled, a source/destination request is serviced." name="HALF_CFG" value="0x1"/>
        <value caption="When there is enough space/data available to perform a single AHB access, then the request is serviced." name="ASAP_CFG" value="0x2"/>
      </value-group>
      <value-group caption="" name="DMAC_DSCR3__DSCR_IF">
        <value caption="The buffer transfer descriptor is fetched via AHB-Lite Interface 0" name="AHB_IF0" value="0x0"/>
        <value caption="The buffer transfer descriptor is fetched via AHB-Lite Interface 1" name="AHB_IF1" value="0x1"/>
        <value caption="The buffer transfer descriptor is fetched via AHB-Lite Interface 2" name="AHB_IF2" value="0x2"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLA3__SCSIZE">
        <value caption="1 data transferred" name="CHK_1" value="0x0"/>
        <value caption="4 data transferred" name="CHK_4" value="0x1"/>
        <value caption="8 data transferred" name="CHK_8" value="0x2"/>
        <value caption="16 data transferred" name="CHK_16" value="0x3"/>
        <value caption="32 data transferred" name="CHK_32" value="0x4"/>
        <value caption="64 data transferred" name="CHK_64" value="0x5"/>
        <value caption="128 data transferred" name="CHK_128" value="0x6"/>
        <value caption="256 data transferred" name="CHK_256" value="0x7"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLA3__DCSIZE">
        <value caption="1 data transferred" name="CHK_1" value="0x0"/>
        <value caption="4 data transferred" name="CHK_4" value="0x1"/>
        <value caption="8 data transferred" name="CHK_8" value="0x2"/>
        <value caption="16 data transferred" name="CHK_16" value="0x3"/>
        <value caption="32 data transferred" name="CHK_32" value="0x4"/>
        <value caption="64 data transferred" name="CHK_64" value="0x5"/>
        <value caption="128 data transferred" name="CHK_128" value="0x6"/>
        <value caption="256 data transferred" name="CHK_256" value="0x7"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLA3__SRC_WIDTH">
        <value caption="the transfer size is set to 8-bit width" name="BYTE" value="0x0"/>
        <value caption="the transfer size is set to 16-bit width" name="HALF_WORD" value="0x1"/>
        <value caption="the transfer size is set to 32-bit width" name="WORD" value="0x2"/>
        <value caption="the transfer size is set to 64-bit width" name="DWORD" value="0x3"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLA3__DST_WIDTH">
        <value caption="the transfer size is set to 8-bit width" name="BYTE" value="0x0"/>
        <value caption="the transfer size is set to 16-bit width" name="HALF_WORD" value="0x1"/>
        <value caption="the transfer size is set to 32-bit width" name="WORD" value="0x2"/>
        <value caption="the transfer size is set to 64-bit width" name="DWORD" value="0x3"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB3__SIF">
        <value caption="The source transfer is done via AHB-Lite Interface 0" name="AHB_IF0" value="0x0"/>
        <value caption="The source transfer is done via AHB-Lite Interface 1" name="AHB_IF1" value="0x1"/>
        <value caption="The source transfer is done via AHB-Lite Interface 2" name="AHB_IF2" value="0x2"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB3__DIF">
        <value caption="The destination transfer is done via AHB-Lite Interface 0" name="AHB_IF0" value="0x0"/>
        <value caption="The destination transfer is done via AHB-Lite Interface 1" name="AHB_IF1" value="0x1"/>
        <value caption="The destination transfer is done via AHB-Lite Interface 2" name="AHB_IF2" value="0x2"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB3__SRC_PIP">
        <value caption="Picture-in-Picture mode is disabled. The source data area is contiguous." name="DISABLE" value="0"/>
        <value caption="Picture-in-Picture mode is enabled. When the source PIP counter reaches the programmable boundary, the address is automatically incremented by a user defined amount." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB3__DST_PIP">
        <value caption="Picture-in-Picture mode is disabled. The Destination data area is contiguous." name="DISABLE" value="0"/>
        <value caption="Picture-in-Picture mode is enabled. When the Destination PIP counter reaches the programmable boundary the address is automatically incremented by a user-defined amount." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB3__SRC_DSCR">
        <value caption="Source address is updated when the descriptor is fetched from the memory." name="FETCH_FROM_MEM" value="0"/>
        <value caption="Buffer Descriptor Fetch operation is disabled for the source." name="FETCH_DISABLE" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB3__DST_DSCR">
        <value caption="Destination address is updated when the descriptor is fetched from the memory." name="FETCH_FROM_MEM" value="0"/>
        <value caption="Buffer Descriptor Fetch operation is disabled for the destination." name="FETCH_DISABLE" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB3__FC">
        <value caption="Memory-to-Memory Transfer DMAC is flow controller" name="MEM2MEM_DMA_FC" value="0x0"/>
        <value caption="Memory-to-Peripheral Transfer DMAC is flow controller" name="MEM2PER_DMA_FC" value="0x1"/>
        <value caption="Peripheral-to-Memory Transfer DMAC is flow controller" name="PER2MEM_DMA_FC" value="0x2"/>
        <value caption="Peripheral-to-Peripheral Transfer DMAC is flow controller" name="PER2PER_DMA_FC" value="0x3"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB3__SRC_INCR">
        <value caption="The source address is incremented" name="INCREMENTING" value="0x0"/>
        <value caption="The source address is decremented" name="DECREMENTING" value="0x1"/>
        <value caption="The source address remains unchanged" name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB3__DST_INCR">
        <value caption="The destination address is incremented" name="INCREMENTING" value="0x0"/>
        <value caption="The destination address is decremented" name="DECREMENTING" value="0x1"/>
        <value caption="The destination address remains unchanged" name="FIXED" value="0x2"/>
      </value-group>
