MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D31.atdf
      <value-group caption="" name="HSMCI_WPSR__WP_VS">
        <value caption="No Write Protection Violation occurred since the last read of this register (WP_SR)" name="NONE" value="0x0"/>
        <value caption="Write Protection detected unauthorized attempt to write a control register had occurred (since the last read.)" name="WRITE" value="0x1"/>
        <value caption="Software reset had been performed while Write Protection was enabled (since the last read)." name="RESET" value="0x2"/>
        <value caption="Both Write Protection violation and software reset with Write Protection enabled have occurred since the last read." name="BOTH" value="0x3"/>
      </value-group>
    </module>
    <module caption="Image Sensor Interface" name="ISI" version="6350F">
      <register-group name="ISI">
        <register caption="ISI Configuration 1 Register" name="ISI_CFG1" offset="0x00" rw="RW" size="4">
          <bitfield caption="Horizontal Synchronization Polarity" mask="0x00000004" name="HSYNC_POL"/>
          <bitfield caption="Vertical Synchronization Polarity" mask="0x00000008" name="VSYNC_POL"/>
          <bitfield caption="Pixel Clock Polarity" mask="0x00000010" name="PIXCLK_POL"/>
          <bitfield caption="Embedded Synchronization" mask="0x00000040" name="EMB_SYNC"/>
          <bitfield caption="Embedded Synchronization Correction" mask="0x00000080" name="CRC_SYNC"/>
          <bitfield caption="Frame Rate [0..7]" mask="0x00000700" name="FRATE"/>
          <bitfield caption="Disable Codec Request" mask="0x00000800" name="DISCR"/>
          <bitfield caption="Full Mode is Allowed" mask="0x00001000" name="FULL"/>
          <bitfield caption="Threshold Mask" mask="0x00006000" name="THMASK" values="ISI_CFG1__THMASK"/>
          <bitfield caption="Start of Line Delay" mask="0x00FF0000" name="SLD"/>
          <bitfield caption="Start of Frame Delay" mask="0xFF000000" name="SFD"/>
        </register>
        <register caption="ISI Configuration 2 Register" name="ISI_CFG2" offset="0x04" rw="RW" size="4">
          <bitfield caption="Vertical Size of the Image Sensor [0..2047]:" mask="0x000007FF" name="IM_VSIZE"/>
          <bitfield caption="" mask="0x00000800" name="GS_MODE"/>
          <bitfield caption="RGB Input Mode:" mask="0x00001000" name="RGB_MODE"/>
          <bitfield caption="" mask="0x00002000" name="GRAYSCALE"/>
          <bitfield caption="" mask="0x00004000" name="RGB_SWAP"/>
          <bitfield caption="Color Space for the Image Data" mask="0x00008000" name="COL_SPACE"/>
          <bitfield caption="Horizontal Size of the Image Sensor [0..2047]" mask="0x07FF0000" name="IM_HSIZE"/>
          <bitfield caption="Defines the YCC Image Data" mask="0x30000000" name="YCC_SWAP"/>
          <bitfield caption="Defines RGB Pattern when RGB_MODE is set to 1" mask="0xC0000000" name="RGB_CFG"/>
        </register>
        <register caption="ISI Preview Size Register" name="ISI_PSIZE" offset="0x08" rw="RW" size="4">
          <bitfield caption="Vertical Size for the Preview Path" mask="0x000003FF" name="PREV_VSIZE"/>
          <bitfield caption="Horizontal Size for the Preview Path" mask="0x03FF0000" name="PREV_HSIZE"/>
        </register>
        <register caption="ISI Preview Decimation Factor Register" name="ISI_PDECF" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Decimation Factor" mask="0x000000FF" name="DEC_FACTOR"/>
        </register>
        <register caption="ISI CSC YCrCb To RGB Set 0 Register" name="ISI_Y2R_SET0" offset="0x10" rw="RW" size="4">
          <bitfield caption="Color Space Conversion Matrix Coefficient C0" mask="0x000000FF" name="C0"/>
          <bitfield caption="Color Space Conversion Matrix Coefficient C1" mask="0x0000FF00" name="C1"/>
          <bitfield caption="Color Space Conversion Matrix Coefficient C2" mask="0x00FF0000" name="C2"/>
          <bitfield caption="Color Space Conversion Matrix Coefficient C3" mask="0xFF000000" name="C3"/>
        </register>
        <register caption="ISI CSC YCrCb To RGB Set 1 Register" name="ISI_Y2R_SET1" offset="0x14" rw="RW" size="4">
          <bitfield caption="Color Space Conversion Matrix Coefficient C4" mask="0x000001FF" name="C4"/>
          <bitfield caption="Color Space Conversion Luminance Default Offset" mask="0x00001000" name="Yoff"/>
          <bitfield caption="Color Space Conversion Red Chrominance Default Offset" mask="0x00002000" name="Croff"/>
          <bitfield caption="Color Space Conversion Blue Chrominance Default Offset" mask="0x00004000" name="Cboff"/>
        </register>
        <register caption="ISI CSC RGB To YCrCb Set 0 Register" name="ISI_R2Y_SET0" offset="0x18" rw="RW" size="4">
          <bitfield caption="Color Space Conversion Matrix Coefficient C0" mask="0x0000007F" name="C0"/>
          <bitfield caption="Color Space Conversion Matrix Coefficient C1" mask="0x00007F00" name="C1"/>
          <bitfield caption="Color Space Conversion Matrix Coefficient C2" mask="0x007F0000" name="C2"/>
          <bitfield caption="Color Space Conversion Red Component Offset" mask="0x01000000" name="Roff"/>
        </register>
        <register caption="ISI CSC RGB To YCrCb Set 1 Register" name="ISI_R2Y_SET1" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Color Space Conversion Matrix Coefficient C3" mask="0x0000007F" name="C3"/>
          <bitfield caption="Color Space Conversion Matrix Coefficient C4" mask="0x00007F00" name="C4"/>
          <bitfield caption="Color Space Conversion Matrix Coefficient C5" mask="0x007F0000" name="C5"/>
          <bitfield caption="Color Space Conversion Green Component Offset" mask="0x01000000" name="Goff"/>
        </register>
        <register caption="ISI CSC RGB To YCrCb Set 2 Register" name="ISI_R2Y_SET2" offset="0x20" rw="RW" size="4">
          <bitfield caption="Color Space Conversion Matrix Coefficient C6" mask="0x0000007F" name="C6"/>
          <bitfield caption="Color Space Conversion Matrix Coefficient C7" mask="0x00007F00" name="C7"/>
          <bitfield caption="Color Space Conversion Matrix Coefficient C8" mask="0x007F0000" name="C8"/>
          <bitfield caption="Color Space Conversion Blue Component Offset" mask="0x01000000" name="Boff"/>
        </register>
        <register caption="ISI Control Register" name="ISI_CR" offset="0x24" rw="W" size="4">
          <bitfield caption="ISI Module Enable Request" mask="0x00000001" name="ISI_EN"/>
          <bitfield caption="ISI Module Disable Request" mask="0x00000002" name="ISI_DIS"/>
          <bitfield caption="ISI Software Reset Request" mask="0x00000004" name="ISI_SRST"/>
          <bitfield caption="ISI Codec Request" mask="0x00000100" name="ISI_CDC"/>
        </register>
        <register caption="ISI Status Register" name="ISI_SR" offset="0x28" rw="R" size="4">
          <bitfield caption="" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="Module Disable Request has Terminated" mask="0x00000002" name="DIS_DONE"/>
          <bitfield caption="Module Software Reset Request has Terminated" mask="0x00000004" name="SRST"/>
          <bitfield caption="Pending Codec Request (this bit is a status bit)" mask="0x00000100" name="CDC_PND"/>
          <bitfield caption="Vertical Synchronization" mask="0x00000400" name="VSYNC"/>
          <bitfield caption="Preview DMA Transfer has Terminated." mask="0x00010000" name="PXFR_DONE"/>
          <bitfield caption="Codec DMA Transfer has Terminated." mask="0x00020000" name="CXFR_DONE"/>
          <bitfield caption="Synchronization in Progress (this is a status bit)" mask="0x00080000" name="SIP"/>
          <bitfield caption="Preview Datapath Overflow" mask="0x01000000" name="P_OVR"/>
          <bitfield caption="Codec Datapath Overflow" mask="0x02000000" name="C_OVR"/>
          <bitfield caption="CRC Synchronization Error" mask="0x04000000" name="CRC_ERR"/>
          <bitfield caption="Frame Rate Overrun" mask="0x08000000" name="FR_OVR"/>
        </register>
        <register caption="ISI Interrupt Enable Register" name="ISI_IER" offset="0x2C" rw="W" size="4">
          <bitfield caption="Disable Done Interrupt Enable" mask="0x00000002" name="DIS_DONE"/>
          <bitfield caption="Software Reset Interrupt Enable" mask="0x00000004" name="SRST"/>
          <bitfield caption="Vertical Synchronization Interrupt Enable" mask="0x00000400" name="VSYNC"/>
          <bitfield caption="Preview DMA Transfer Done Interrupt Enable" mask="0x00010000" name="PXFR_DONE"/>
          <bitfield caption="Codec DMA Transfer Done Interrupt Enable" mask="0x00020000" name="CXFR_DONE"/>
          <bitfield caption="Preview Datapath Overflow Interrupt Enable" mask="0x01000000" name="P_OVR"/>
          <bitfield caption="Codec Datapath Overflow Interrupt Enable" mask="0x02000000" name="C_OVR"/>
          <bitfield caption="Embedded Synchronization CRC Error Interrupt Enable" mask="0x04000000" name="CRC_ERR"/>
          <bitfield caption="Frame Rate Overflow Interrupt Enable" mask="0x08000000" name="FR_OVR"/>
        </register>
