MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D31.atdf
        <register caption="High-End Overlay Configuration Register 37" name="LCDC_HEOCFG37" offset="0x00000420" rw="RW" size="4">
          <bitfield caption="Vertical Coefficient for phase 4 tap 0" mask="0x000000FF" name="YPHI4COEFF0"/>
          <bitfield caption="Vertical Coefficient for phase 4 tap 1" mask="0x0000FF00" name="YPHI4COEFF1"/>
          <bitfield caption="Vertical Coefficient for phase 4 tap 2" mask="0x00FF0000" name="YPHI4COEFF2"/>
        </register>
        <register caption="High-End Overlay Configuration Register 38" name="LCDC_HEOCFG38" offset="0x00000424" rw="RW" size="4">
          <bitfield caption="Vertical Coefficient for phase 5 tap 0" mask="0x000000FF" name="YPHI5COEFF0"/>
          <bitfield caption="Vertical Coefficient for phase 5 tap 1" mask="0x0000FF00" name="YPHI5COEFF1"/>
          <bitfield caption="Vertical Coefficient for phase 5 tap 2" mask="0x00FF0000" name="YPHI5COEFF2"/>
        </register>
        <register caption="High-End Overlay Configuration Register 39" name="LCDC_HEOCFG39" offset="0x00000428" rw="RW" size="4">
          <bitfield caption="Vertical Coefficient for phase 6 tap 0" mask="0x000000FF" name="YPHI6COEFF0"/>
          <bitfield caption="Vertical Coefficient for phase 6 tap 1" mask="0x0000FF00" name="YPHI6COEFF1"/>
          <bitfield caption="Vertical Coefficient for phase 6 tap 2" mask="0x00FF0000" name="YPHI6COEFF2"/>
        </register>
        <register caption="High-End Overlay Configuration Register 40" name="LCDC_HEOCFG40" offset="0x0000042C" rw="RW" size="4">
          <bitfield caption="Vertical Coefficient for phase 7 tap 0" mask="0x000000FF" name="YPHI7COEFF0"/>
          <bitfield caption="Vertical Coefficient for phase 7 tap 1" mask="0x0000FF00" name="YPHI7COEFF1"/>
          <bitfield caption="Vertical Coefficient for phase 7 tap 2" mask="0x00FF0000" name="YPHI7COEFF2"/>
        </register>
        <register caption="High-End Overlay Configuration Register 41" name="LCDC_HEOCFG41" offset="0x00000430" rw="RW" size="4">
          <bitfield caption="Horizontal Filter Phase Offset" mask="0x00000007" name="XPHIDEF"/>
          <bitfield caption="Vertical Filter Phase Offset" mask="0x00070000" name="YPHIDEF"/>
        </register>
        <register caption="Hardware Cursor Channel Enable Register" name="LCDC_HCRCHER" offset="0x00000440" rw="W" size="4">
          <bitfield caption="Channel Enable Register" mask="0x00000001" name="CHEN"/>
          <bitfield caption="Update Overlay Attributes Enable Register" mask="0x00000002" name="UPDATEEN"/>
          <bitfield caption="Add Head Pointer Enable Register" mask="0x00000004" name="A2QEN"/>
        </register>
        <register caption="Hardware Cursor Channel disable Register" name="LCDC_HCRCHDR" offset="0x00000444" rw="W" size="4">
          <bitfield caption="Channel Disable Register" mask="0x00000001" name="CHDIS"/>
          <bitfield caption="Channel Reset Register" mask="0x00000100" name="CHRST"/>
        </register>
        <register caption="Hardware Cursor Channel Status Register" name="LCDC_HCRCHSR" offset="0x00000448" rw="R" size="4">
          <bitfield caption="Channel Status Register" mask="0x00000001" name="CHSR"/>
          <bitfield caption="Update Overlay Attributes In Progress" mask="0x00000002" name="UPDATESR"/>
          <bitfield caption="Add To Queue Pending Register" mask="0x00000004" name="A2QSR"/>
        </register>
        <register caption="Hardware Cursor Interrupt Enable Register" name="LCDC_HCRIER" offset="0x0000044C" rw="W" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Enable Register" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable Register" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Enable Register" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Enable Register" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Interrupt Enable Register" mask="0x00000040" name="OVR"/>
        </register>
        <register caption="Hardware Cursor Interrupt Disable Register" name="LCDC_HCRIDR" offset="0x00000450" rw="W" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Disable Register" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Disable Register" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Disable Register" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Disable Register" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Interrupt Disable Register" mask="0x00000040" name="OVR"/>
        </register>
        <register caption="Hardware Cursor Interrupt Mask Register" name="LCDC_HCRIMR" offset="0x00000454" rw="R" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Mask Register" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Mask Register" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Mask Register" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Mask Register" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Interrupt Mask Register" mask="0x00000040" name="OVR"/>
        </register>
        <register caption="Hardware Cursor Interrupt Status Register" name="LCDC_HCRISR" offset="0x00000458" rw="R" size="4">
          <bitfield caption="End of DMA Transfer" mask="0x00000004" name="DMA"/>
          <bitfield caption="DMA Descriptor Loaded" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Detected" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Detected" mask="0x00000040" name="OVR"/>
        </register>
        <register caption="Hardware Cursor DMA Head Register" name="LCDC_HCRHEAD" offset="0x0000045C" rw="RW" size="4">
          <bitfield caption="DMA Head Pointer" mask="0xFFFFFFFC" name="HEAD"/>
        </register>
        <register caption="Hardware cursor DMA Address Register" name="LCDC_HCRADDR" offset="0x00000460" rw="RW" size="4">
          <bitfield caption="DMA Transfer start address" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
