MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D31.atdf
        <register caption="Overlay 1 CLUT Register 31" name="LCDC_OVR1CLUT31" offset="0xA7C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 32" name="LCDC_OVR1CLUT32" offset="0xA80" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 33" name="LCDC_OVR1CLUT33" offset="0xA84" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 34" name="LCDC_OVR1CLUT34" offset="0xA88" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 35" name="LCDC_OVR1CLUT35" offset="0xA8C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 36" name="LCDC_OVR1CLUT36" offset="0xA90" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 37" name="LCDC_OVR1CLUT37" offset="0xA94" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 38" name="LCDC_OVR1CLUT38" offset="0xA98" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 39" name="LCDC_OVR1CLUT39" offset="0xA9C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 40" name="LCDC_OVR1CLUT40" offset="0xAA0" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 41" name="LCDC_OVR1CLUT41" offset="0xAA4" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 42" name="LCDC_OVR1CLUT42" offset="0xAA8" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 43" name="LCDC_OVR1CLUT43" offset="0xAAC" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 44" name="LCDC_OVR1CLUT44" offset="0xAB0" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 45" name="LCDC_OVR1CLUT45" offset="0xAB4" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
