MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D31.atdf
        <register caption="Overlay 2 CLUT Register 104" name="LCDC_OVR2CLUT104" offset="0xFA0" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 105" name="LCDC_OVR2CLUT105" offset="0xFA4" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 106" name="LCDC_OVR2CLUT106" offset="0xFA8" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 107" name="LCDC_OVR2CLUT107" offset="0xFAC" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 108" name="LCDC_OVR2CLUT108" offset="0xFB0" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 109" name="LCDC_OVR2CLUT109" offset="0xFB4" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 110" name="LCDC_OVR2CLUT110" offset="0xFB8" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 111" name="LCDC_OVR2CLUT111" offset="0xFBC" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 112" name="LCDC_OVR2CLUT112" offset="0xFC0" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 113" name="LCDC_OVR2CLUT113" offset="0xFC4" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 114" name="LCDC_OVR2CLUT114" offset="0xFC8" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 115" name="LCDC_OVR2CLUT115" offset="0xFCC" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 116" name="LCDC_OVR2CLUT116" offset="0xFD0" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 117" name="LCDC_OVR2CLUT117" offset="0xFD4" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 118" name="LCDC_OVR2CLUT118" offset="0xFD8" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
