MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D31.atdf
        <register caption="MPDDRC Low-power Register" name="MPDDRC_LPR" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Low-power Command Bit" mask="0x00000003" name="LPCB" values="MPDDRC_LPR__LPCB"/>
          <bitfield caption="Clock Frozen Command Bit" mask="0x00000004" name="CLK_FR" values="MPDDRC_LPR__CLK_FR"/>
          <bitfield caption="LPDDR2 Power Off Bit" mask="0x00000008" name="LPDDR2_PWOFF" values="MPDDRC_LPR__LPDDR2_PWOFF"/>
          <bitfield caption="Partial Array Self Refresh" mask="0x00000070" name="PASR"/>
          <bitfield caption="Drive Strength" mask="0x00000700" name="DS"/>
          <bitfield caption="Enter Low-power Mode" mask="0x00003000" name="TIMEOUT" values="MPDDRC_LPR__TIMEOUT"/>
          <bitfield caption="Active Power Down Exit Time" mask="0x00010000" name="APDE" values="MPDDRC_LPR__APDE"/>
          <bitfield caption="Update Load Mode Register and Extended Mode Register" mask="0x00300000" name="UPD_MR"/>
        </register>
        <register caption="MPDDRC Memory Device Register" name="MPDDRC_MD" offset="0x20" rw="RW" size="4">
          <bitfield caption="Memory Device" mask="0x00000007" name="MD" values="MPDDRC_MD__MD"/>
          <bitfield caption="Data Bus Width" mask="0x00000010" name="DBW" values="MPDDRC_MD__DBW"/>
        </register>
        <register caption="MPDDRC LPDDR2 Low-power Register" name="MPDDRC_LPDDR2_LPR" offset="0x28" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="BK_MASK"/>
          <bitfield caption="Segment Mask Bit" mask="0x00FFFF00" name="SEG_MASK"/>
          <bitfield caption="Drive strength" mask="0x0F000000" name="DS"/>
        </register>
        <register caption="MPDDRC LPDDR2 Calibration and MR4 Register" name="MPDDRC_LPDDR2_CAL_MR4" offset="0x2C" rw="RW" size="4">
          <bitfield caption="LPDDR2 Calibration Timer Count" mask="0x0000FFFF" name="COUNT_CAL"/>
          <bitfield caption="Mode Register 4 Read Interval" mask="0xFFFF0000" name="MR4_READ"/>
        </register>
        <register caption="MPDDRC LPDDR2 Timing Calibration Register" name="MPDDRC_LPDDR2_TIM_CAL" offset="0x30" rw="RW" size="4">
          <bitfield caption="ZQ Calibration Short" mask="0x000000FF" name="ZQCS"/>
        </register>
        <register caption="MPDDRC IO Calibration" name="MPDDRC_IO_CALIBR" offset="0x34" rw="RW" size="4">
          <bitfield caption="Resistor Divider, output driver impedance" mask="0x00000007" name="RDIV" values="MPDDRC_IO_CALIBR__RDIV"/>
          <bitfield caption="IO Calibration" mask="0x00000700" name="TZQIO"/>
          <bitfield caption="Number of Transistor P" mask="0x000F0000" name="CALCODEP"/>
          <bitfield caption="Number of Transistor N" mask="0x00F00000" name="CALCODEN"/>
        </register>
        <register caption="MPDDRC OCMS Register" name="MPDDRC_OCMS" offset="0x38" rw="RW" size="4">
          <bitfield caption="Scrambling enable" mask="0x00000001" name="SCR_EN"/>
        </register>
        <register caption="MPDDRC OCMS KEY1 Register" name="MPDDRC_OCMS_KEY1" offset="0x3C" rw="W" size="4">
          <bitfield caption="Off Chip Memory Scrambling (OCMS) Key Part 1" mask="0xFFFFFFFF" name="KEY1"/>
        </register>
        <register caption="MPDDRC OCMS KEY2 Register" name="MPDDRC_OCMS_KEY2" offset="0x40" rw="W" size="4">
          <bitfield caption="Off Chip Memory Scrambling (OCMS) Key Part 2" mask="0xFFFFFFFF" name="KEY2"/>
        </register>
        <register caption="MPDDRC DLL Master Offset Register" name="MPDDRC_DLL_MOR" offset="0x74" rw="RW" size="4">
          <bitfield caption="DLL Master Delay Line Offset" mask="0x0000000F" name="MOFF"/>
          <bitfield caption="DLL CLK90 Delay Line Offset" mask="0x00001F00" name="CLK90OFF"/>
          <bitfield caption="DLL Offset Selection" mask="0x00010000" name="SELOFF"/>
        </register>
        <register caption="MPDDRC DLL Slave Offset Register" name="MPDDRC_DLL_SOR" offset="0x78" rw="RW" size="4">
          <bitfield caption="DLL Slave 0 Delay Line Offset ([x=0..3])" mask="0x0000001F" name="S0OFF"/>
          <bitfield caption="DLL Slave 1 Delay Line Offset ([x=0..3])" mask="0x00001F00" name="S1OFF"/>
          <bitfield caption="DLL Slave 2 Delay Line Offset ([x=0..3])" mask="0x001F0000" name="S2OFF"/>
          <bitfield caption="DLL Slave 3 Delay Line Offset ([x=0..3])" mask="0x1F000000" name="S3OFF"/>
        </register>
        <register caption="MPDDRC DLL Master Status Register" name="MPDDRC_DLL_MSR" offset="0x7C" rw="R" size="4">
          <bitfield caption="DLL Master Delay Increment" mask="0x00000001" name="MDINC"/>
          <bitfield caption="DLL Master Delay Decrement" mask="0x00000002" name="MDDEC"/>
          <bitfield caption="DLL Master Delay Overflow Flag" mask="0x00000004" name="MDOVF"/>
          <bitfield caption="DLL Master Delay Value" mask="0x0000FF00" name="MDVAL"/>
        </register>
        <register caption="MPDDRC DLL Slave 0 Status Register 0" name="MPDDRC_DLL_SxSR0" offset="0x80" rw="R" size="4">
          <bitfield caption="DLL Slave x Delay Correction Overflow Flag" mask="0x00000001" name="SDCOVF"/>
          <bitfield caption="DLL Slave x Delay Correction Underflow Flag" mask="0x00000002" name="SDCUDF"/>
          <bitfield caption="DLL Slave x Delay Correction Error Flag" mask="0x00000004" name="SDERF"/>
          <bitfield caption="DLL Slave x Delay Value" mask="0x0000FF00" name="SDVAL"/>
          <bitfield caption="DLL Slave x Delay Correction Value" mask="0x00FF0000" name="SDCVAL"/>
        </register>
        <register caption="MPDDRC DLL Slave 0 Status Register 1" name="MPDDRC_DLL_SxSR1" offset="0x84" rw="R" size="4">
          <bitfield caption="DLL Slave x Delay Correction Overflow Flag" mask="0x00000001" name="SDCOVF"/>
          <bitfield caption="DLL Slave x Delay Correction Underflow Flag" mask="0x00000002" name="SDCUDF"/>
          <bitfield caption="DLL Slave x Delay Correction Error Flag" mask="0x00000004" name="SDERF"/>
          <bitfield caption="DLL Slave x Delay Value" mask="0x0000FF00" name="SDVAL"/>
          <bitfield caption="DLL Slave x Delay Correction Value" mask="0x00FF0000" name="SDCVAL"/>
        </register>
