MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D31.atdf
      <value-group caption="" name="RTC_CR__CALEVSEL">
        <value caption="Week change (every Monday at time 00:00:00)" name="WEEK" value="0x0"/>
        <value caption="Month change (every 01 of each month at time 00:00:00)" name="MONTH" value="0x1"/>
        <value caption="Year change (every January 1 at time 00:00:00)" name="YEAR" value="0x2"/>
      </value-group>
    </module>
    <module caption="Slow Clock Controller" name="SCKC" version="11073B">
      <register-group name="SCKC">
        <register caption="Slow Clock Configuration Register" name="SCKC_CR" offset="0x0" rw="RW" size="4">
          <bitfield caption="Internal 32 kHz RC Oscillator" mask="0x00000001" name="RCEN"/>
          <bitfield caption="32,768 Hz Oscillator" mask="0x00000002" name="OSC32EN"/>
          <bitfield caption="32,768Hz Oscillator Bypass" mask="0x00000004" name="OSC32BYP"/>
          <bitfield caption="Slow Clock Selector" mask="0x00000008" name="OSCSEL" values="SCKC_CR__OSCSEL"/>
        </register>
      </register-group>
      <value-group caption="" name="SCKC_CR__OSCSEL">
        <value caption="Slow clock is internal 32 kHz RC oscillator." name="RC" value="0"/>
        <value caption="Slow clock is 32,768 Hz oscillator." name="XTAL" value="1"/>
      </value-group>
    </module>
    <module caption="Special Function Registers" name="SFR" version="11066A">
      <register-group name="SFR">
        <register caption="OHCI Interrupt Configuration Register" name="SFR_OHCIICR" offset="0x10" rw="RW" size="4">
          <bitfield caption="USB PORTx RESET" mask="0x00000001" name="RES0"/>
          <bitfield caption="USB PORTx RESET" mask="0x00000002" name="RES1"/>
          <bitfield caption="USB PORTx RESET" mask="0x00000004" name="RES2"/>
          <bitfield caption="OHCI Asynchronous Resume Interrupt Enable" mask="0x00000010" name="ARIE"/>
          <bitfield caption="Reserved" mask="0x00000020" name="APPSTART"/>
          <bitfield caption="OHCI USB DEVICE PULL-UP DISABLE" mask="0x00800000" name="UDPPUDIS"/>
        </register>
        <register caption="OHCI Interrupt Status Register" name="SFR_OHCIISR" offset="0x14" rw="R" size="4">
          <bitfield caption="OHCI Resume Interrupt Status Port 0" mask="0x00000001" name="RIS0"/>
          <bitfield caption="OHCI Resume Interrupt Status Port 1" mask="0x00000002" name="RIS1"/>
          <bitfield caption="OHCI Resume Interrupt Status Port 2" mask="0x00000004" name="RIS2"/>
        </register>
        <register caption="AHB Configuration Register" name="SFR_AHB" offset="0x20" rw="RW" size="4">
          <bitfield caption="AHB MASTERx 10 Converter Prefetch" mask="0x00000400" name="PFETCH10" values="SFR_AHB__PFETCH10"/>
          <bitfield caption="AHB MASTERx 11 Converter Prefetch" mask="0x00000800" name="PFETCH11" values="SFR_AHB__PFETCH11"/>
          <bitfield caption="AHB MASTERx 12 Converter Prefetch" mask="0x00001000" name="PFETCH12" values="SFR_AHB__PFETCH12"/>
          <bitfield caption="AHB MASTERx 13 Converter Prefetch" mask="0x00002000" name="PFETCH13" values="SFR_AHB__PFETCH13"/>
          <bitfield caption="AHB MASTERx 14 Converter Prefetch" mask="0x00004000" name="PFETCH14" values="SFR_AHB__PFETCH14"/>
          <bitfield caption="AHB MASTERx 10 Converter Define Length Burst Optimization" mask="0x04000000" name="DLBOPT10"/>
          <bitfield caption="AHB MASTERx 11 Converter Define Length Burst Optimization" mask="0x08000000" name="DLBOPT11"/>
          <bitfield caption="AHB MASTERx 12 Converter Define Length Burst Optimization" mask="0x10000000" name="DLBOPT12"/>
          <bitfield caption="AHB MASTERx 13 Converter Define Length Burst Optimization" mask="0x20000000" name="DLBOPT13"/>
          <bitfield caption="AHB MASTERx 14 Converter Define Length Burst Optimization" mask="0x40000000" name="DLBOPT14"/>
        </register>
        <register caption="Bridge Configuration Register" name="SFR_BRIDGE" offset="0x24" rw="RW" size="4">
          <bitfield caption="AHB to APB Bridge mode" mask="0x00000001" name="APBTURBO"/>
          <bitfield caption="AXI to AHB bridge for DDR controller selection" mask="0x00000100" name="AXI2AHBSEL" values="SFR_BRIDGE__AXI2AHBSEL"/>
        </register>
        <register caption="Security Configuration Register" name="SFR_SECURE" offset="0x28" rw="RW" size="4">
          <bitfield caption="Disable Access to ROM Code" mask="0x00000001" name="ROM"/>
          <bitfield caption="Disable Access to Fuse Controller" mask="0x00000100" name="FUSE"/>
        </register>
        <register caption="UTMI Clock Trimming Register" name="SFR_UTMICKTRIM" offset="0x30" rw="RW" size="4">
          <bitfield caption="UTMI Reference Clock Frequency" mask="0x00000003" name="FREQ" values="SFR_UTMICKTRIM__FREQ"/>
          <bitfield caption="UTMI Band Gap Voltage Trimming" mask="0x000F0000" name="VBG"/>
        </register>
        <register caption="UTMI High Speed Trimming Register" name="SFR_UTMIHSTRIM" offset="0x34" rw="RW" size="4">
          <bitfield caption="UTMI HS SQUELCH Voltage Trimming" mask="0x00000007" name="SQUELCH"/>
          <bitfield caption="UTMI Disconnect Voltage Trimming" mask="0x00000070" name="DISC"/>
          <bitfield caption="UTMI HS PORTx Transceiver Slope Trimming" mask="0x00000700" name="SLOPE0"/>
          <bitfield caption="UTMI HS PORTx Transceiver Slope Trimming" mask="0x00007000" name="SLOPE1"/>
          <bitfield caption="UTMI HS PORTx Transceiver Slope Trimming" mask="0x00070000" name="SLOPE2"/>
        </register>
        <register caption="UTMI Full Speed Trimming Register" name="SFR_UTMIFSTRIM" offset="0x38" rw="RW" size="4">
          <bitfield caption="FS Transceiver output rising slope trimming" mask="0x00000007" name="RISE"/>
          <bitfield caption="FS Transceiver output falling slope trimming" mask="0x00000070" name="FALL"/>
          <bitfield caption="FS Transceiver crossover voltage trimming" mask="0x00000300" name="XCVR"/>
          <bitfield caption="FS Transceiver NMOS impedance trimming" mask="0x00070000" name="ZN"/>
          <bitfield caption="FS Transceiver PMOS impedance trimming" mask="0x00700000" name="ZP"/>
        </register>
