MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D31.atdf
    <module caption="Static Memory Controller" name="SMC" version="11036C">
      <register-group name="SMC">
        <register caption="SMC NFC Configuration Register" name="SMC_CFG" offset="0x000" rw="RW" size="4">
          <bitfield caption="" mask="0x00000007" name="PAGESIZE" values="SMC_CFG__PAGESIZE"/>
          <bitfield caption="Write Spare Area" mask="0x00000100" name="WSPARE"/>
          <bitfield caption="Read Spare Area" mask="0x00000200" name="RSPARE"/>
          <bitfield caption="Rising/Falling Edge Detection Control" mask="0x00001000" name="EDGECTRL"/>
          <bitfield caption="Ready/Busy Signal Edge Detection" mask="0x00002000" name="RBEDGE"/>
          <bitfield caption="Data Timeout Cycle Number" mask="0x000F0000" name="DTOCYC"/>
          <bitfield caption="Data Timeout Multiplier" mask="0x00700000" name="DTOMUL" values="SMC_CFG__DTOMUL"/>
          <bitfield caption="NAND Flash Spare Area Size Retrieved by the Host Controller" mask="0x7F000000" name="NFCSPARESIZE"/>
        </register>
        <register caption="SMC NFC Control Register" name="SMC_CTRL" offset="0x004" rw="W" size="4">
          <bitfield caption="NAND Flash Controller Enable" mask="0x00000001" name="NFCEN"/>
          <bitfield caption="NAND Flash Controller Disable" mask="0x00000002" name="NFCDIS"/>
        </register>
        <register caption="SMC NFC Status Register" name="SMC_SR" offset="0x008" rw="R" size="4">
          <bitfield caption="NAND Flash Controller Status (this field cannot be reset)" mask="0x00000001" name="SMCSTS"/>
          <bitfield caption="Selected Ready Busy Rising Edge Detected" mask="0x00000010" name="RB_RISE"/>
          <bitfield caption="Selected Ready Busy Falling Edge Detected" mask="0x00000020" name="RB_FALL"/>
          <bitfield caption="NFC Busy (this field cannot be reset)" mask="0x00000100" name="NFCBUSY"/>
          <bitfield caption="NFC Write/Read Operation (this field cannot be reset)" mask="0x00000800" name="NFCWR"/>
          <bitfield caption="NFC Chip Select ID (this field cannot be reset)" mask="0x00007000" name="NFCSID"/>
          <bitfield caption="NFC Data Transfer Terminated" mask="0x00010000" name="XFRDONE"/>
          <bitfield caption="Command Done" mask="0x00020000" name="CMDDONE"/>
          <bitfield caption="Hamming ECC Ready" mask="0x00040000" name="ECCRDY"/>
          <bitfield caption="Data Timeout Error" mask="0x00100000" name="DTOE"/>
          <bitfield caption="Undefined Area Error" mask="0x00200000" name="UNDEF"/>
          <bitfield caption="Accessing While Busy" mask="0x00400000" name="AWB"/>
          <bitfield caption="NFC Access Size Error" mask="0x00800000" name="NFCASE"/>
          <bitfield caption="Ready/Busy Line 0 Edge Detected" mask="0x01000000" name="RB_EDGE0"/>
        </register>
        <register caption="SMC NFC Interrupt Enable Register" name="SMC_IER" offset="0x00C" rw="W" size="4">
          <bitfield caption="Ready Busy Rising Edge Detection Interrupt Enable" mask="0x00000010" name="RB_RISE"/>
          <bitfield caption="Ready Busy Falling Edge Detection Interrupt Enable" mask="0x00000020" name="RB_FALL"/>
          <bitfield caption="Transfer Done Interrupt Enable" mask="0x00010000" name="XFRDONE"/>
          <bitfield caption="Command Done Interrupt Enable" mask="0x00020000" name="CMDDONE"/>
          <bitfield caption="Data Timeout Error Interrupt Enable" mask="0x00100000" name="DTOE"/>
          <bitfield caption="Undefined Area Access Interrupt Enable" mask="0x00200000" name="UNDEF"/>
          <bitfield caption="Accessing While Busy Interrupt Enable" mask="0x00400000" name="AWB"/>
          <bitfield caption="NFC Access Size Error Interrupt Enable" mask="0x00800000" name="NFCASE"/>
          <bitfield caption="Ready/Busy Line 0 Interrupt Enable" mask="0x01000000" name="RB_EDGE0"/>
        </register>
        <register caption="SMC NFC Interrupt Disable Register" name="SMC_IDR" offset="0x010" rw="W" size="4">
          <bitfield caption="Ready Busy Rising Edge Detection Interrupt Disable" mask="0x00000010" name="RB_RISE"/>
          <bitfield caption="Ready Busy Falling Edge Detection Interrupt Disable" mask="0x00000020" name="RB_FALL"/>
          <bitfield caption="Transfer Done Interrupt Disable" mask="0x00010000" name="XFRDONE"/>
          <bitfield caption="Command Done Interrupt Disable" mask="0x00020000" name="CMDDONE"/>
          <bitfield caption="Data Timeout Error Interrupt Disable" mask="0x00100000" name="DTOE"/>
          <bitfield caption="Undefined Area Access Interrupt Disable" mask="0x00200000" name="UNDEF"/>
          <bitfield caption="Accessing While Busy Interrupt Disable" mask="0x00400000" name="AWB"/>
          <bitfield caption="NFC Access Size Error Interrupt Disable" mask="0x00800000" name="NFCASE"/>
          <bitfield caption="Ready/Busy Line 0 Interrupt Disable" mask="0x01000000" name="RB_EDGE0"/>
        </register>
        <register caption="SMC NFC Interrupt Mask Register" name="SMC_IMR" offset="0x014" rw="R" size="4">
          <bitfield caption="Ready Busy Rising Edge Detection Interrupt Mask" mask="0x00000010" name="RB_RISE"/>
          <bitfield caption="Ready Busy Falling Edge Detection Interrupt Mask" mask="0x00000020" name="RB_FALL"/>
          <bitfield caption="Transfer Done Interrupt Mask" mask="0x00010000" name="XFRDONE"/>
          <bitfield caption="Command Done Interrupt Mask" mask="0x00020000" name="CMDDONE"/>
          <bitfield caption="Data Timeout Error Interrupt Mask" mask="0x00100000" name="DTOE"/>
          <bitfield caption="Undefined Area Access Interrupt Mask5" mask="0x00200000" name="UNDEF"/>
          <bitfield caption="Accessing While Busy Interrupt Mask" mask="0x00400000" name="AWB"/>
          <bitfield caption="NFC Access Size Error Interrupt Mask" mask="0x00800000" name="NFCASE"/>
          <bitfield caption="Ready/Busy Line 0 Interrupt Mask" mask="0x01000000" name="RB_EDGE0"/>
        </register>
        <register caption="SMC NFC Address Cycle Zero Register" name="SMC_ADDR" offset="0x018" rw="RW" size="4">
          <bitfield caption="NAND Flash Array Address Cycle 0" mask="0x000000FF" name="ADDR_CYCLE0"/>
        </register>
