MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D31.atdf
        <register caption="SMC Bank Address Register" name="SMC_BANK" offset="0x01C" rw="RW" size="4">
          <bitfield caption="Bank Identifier" mask="0x00000001" name="BANK"/>
        </register>
        <register caption="SMC ECC Control Register" name="SMC_ECC_CTRL" offset="0x020" rw="W" size="4">
          <bitfield caption="Reset ECC" mask="0x00000001" name="RST"/>
          <bitfield caption="Software Reset" mask="0x00000002" name="SWRST"/>
        </register>
        <register caption="SMC ECC Mode Register" name="SMC_ECC_MD" offset="0x024" rw="RW" size="4">
          <bitfield caption="ECC Page Size" mask="0x00000003" name="ECC_PAGESIZE" values="SMC_ECC_MD__ECC_PAGESIZE"/>
          <bitfield caption="Type of Correction" mask="0x00000030" name="TYPCORREC" values="SMC_ECC_MD__TYPCORREC"/>
          <bitfield caption="Hamming Error Correcting Code Selected" mask="0x00000100" name="HAMMING"/>
        </register>
        <register caption="SMC ECC Status 1 Register" name="SMC_ECC_SR1" offset="0x028" rw="R" size="4">
          <bitfield caption="Recoverable Error" mask="0x00000001" name="RECERR0"/>
          <bitfield caption="ECC Error" mask="0x00000002" name="ECCERR0"/>
          <bitfield caption="Multiple Error" mask="0x00000004" name="MULERR0"/>
          <bitfield caption="Recoverable Error in the page between the 256th and the 511th Bytes or the 512nd and the 1023rd Bytes" mask="0x00000010" name="RECERR1"/>
          <bitfield caption="ECC Error in the page between the 256th and the 511th Bytes or between the 512nd and the 1023rd Bytes" mask="0x00000020" name="ECCERR1"/>
          <bitfield caption="Multiple Error in the page between the 256th and the 511th Bytes or between the 512nd and the 1023rd Bytes" mask="0x00000040" name="MULERR1"/>
          <bitfield caption="Recoverable Error in the page between the 512nd and the 767th Bytes or between the 1024th and the 1535th Bytes" mask="0x00000100" name="RECERR2"/>
          <bitfield caption="ECC Error in the page between the 512nd and the 767th Bytes or between the 1024th and the 1535th Bytes" mask="0x00000200" name="ECCERR2"/>
          <bitfield caption="Multiple Error in the page between the 512nd and the 767th Bytes or between the 1024th and the 1535th Bytes" mask="0x00000400" name="MULERR2"/>
          <bitfield caption="Recoverable Error in the page between the 768th and the 1023rd Bytes or between the 1536th and the 2047th Bytes" mask="0x00001000" name="RECERR3"/>
          <bitfield caption="ECC Error in the page between the 768th and the 1023rd Bytes or between the 1536th and the 2047th Bytes" mask="0x00002000" name="ECCERR3"/>
          <bitfield caption="Multiple Error in the page between the 768th and the 1023rd Bytes or between the 1536th and the 2047th Bytes" mask="0x00004000" name="MULERR3"/>
          <bitfield caption="Recoverable Error in the page between the 1024th and the 1279th Bytes or between the 2048th and the 2559th Bytes" mask="0x00010000" name="RECERR4"/>
          <bitfield caption="ECC Error in the page between the 1024th and the 1279th Bytes or between the 2048th and the 2559th Bytes" mask="0x00020000" name="ECCERR4"/>
          <bitfield caption="Multiple Error in the page between the 1024th and the 1279th Bytes or between the 2048th and the 2559th Bytes" mask="0x00040000" name="MULERR4"/>
          <bitfield caption="Recoverable Error in the page between the 1280th and the 1535th Bytes or between the 2560th and the 3071st Bytes" mask="0x00100000" name="RECERR5"/>
          <bitfield caption="ECC Error in the page between the 1280th and the 1535th Bytes or between the 2560th and the 3071st Bytes" mask="0x00200000" name="ECCERR5"/>
          <bitfield caption="Multiple Error in the page between the 1280th and the 1535th Bytes or between the 2560th and the 3071st Bytes" mask="0x00400000" name="MULERR5"/>
          <bitfield caption="Recoverable Error in the page between the 1536th and the 1791st Bytes or between the 3072nd and the 3583rd Bytes" mask="0x01000000" name="RECERR6"/>
          <bitfield caption="ECC Error in the page between the 1536th and the 1791st Bytes or between the 3072nd and the 3583rd Bytes" mask="0x02000000" name="ECCERR6"/>
          <bitfield caption="Multiple Error in the page between the 1536th and the 1791st Bytes or between the 3072nd and the 3583rd Bytes" mask="0x04000000" name="MULERR6"/>
          <bitfield caption="Recoverable Error in the page between the 1792nd and the 2047th Bytes or between the 3584th and the 4095th Bytes" mask="0x10000000" name="RECERR7"/>
          <bitfield caption="ECC Error in the page between the 1792nd and the 2047th Bytes or between the 3584th and the 4095th Bytes" mask="0x20000000" name="ECCERR7"/>
          <bitfield caption="Multiple Error in the page between the 1792nd and the 2047th Bytes or between the 3584th and the 4095th Bytes" mask="0x40000000" name="MULERR7"/>
        </register>
        <register caption="SMC ECC Parity 0 Register" name="SMC_ECC_PR0" offset="0x02C" rw="R" size="4">
          <bitfield caption="Bit Address" mask="0x0000000F" name="BITADDR"/>
          <bitfield caption="Word Address" mask="0x0000FFF0" name="WORDADDR"/>
        </register>
        <register caption="SMC ECC parity 1 Register" name="SMC_ECC_PR1" offset="0x030" rw="R" size="4">
          <bitfield caption="Parity N" mask="0x0000FFFF" name="NPARITY"/>
        </register>
        <register caption="SMC ECC status 2 Register" name="SMC_ECC_SR2" offset="0x034" rw="R" size="4">
          <bitfield caption="Recoverable Error in the page between the 2048th and the 2303rd Bytes" mask="0x00000001" name="RECERR8"/>
          <bitfield caption="ECC Error in the page between the 2048th and the 2303rd Bytes" mask="0x00000002" name="ECCERR8"/>
          <bitfield caption="Multiple Error in the page between the 2048th and the 2303rd Bytes" mask="0x00000004" name="MULERR8"/>
          <bitfield caption="Recoverable Error in the page between the 2304th and the 2559th Bytes" mask="0x00000010" name="RECERR9"/>
          <bitfield caption="ECC Error in the page between the 2304th and the 2559th Bytes" mask="0x00000020" name="ECCERR9"/>
          <bitfield caption="Multiple Error in the page between the 2304th and the 2559th Bytes" mask="0x00000040" name="MULERR9"/>
          <bitfield caption="Recoverable Error in the page between the 2560th and the 2815th Bytes" mask="0x00000100" name="RECERR10"/>
          <bitfield caption="ECC Error in the page between the 2560th and the 2815th Bytes" mask="0x00000200" name="ECCERR10"/>
          <bitfield caption="Multiple Error in the page between the 2560th and the 2815th Bytes" mask="0x00000400" name="MULERR10"/>
          <bitfield caption="Recoverable Error in the page between the 2816th and the 3071st Bytes" mask="0x00001000" name="RECERR11"/>
          <bitfield caption="ECC Error in the page between the 2816th and the 3071st Bytes" mask="0x00002000" name="ECCERR11"/>
          <bitfield caption="Multiple Error in the page between the 2816th and the 3071st Bytes" mask="0x00004000" name="MULERR11"/>
          <bitfield caption="Recoverable Error in the page between the 3072nd and the 3327th Bytes" mask="0x00010000" name="RECERR12"/>
          <bitfield caption="ECC Error in the page between the 3072nd and the 3327th Bytes" mask="0x00020000" name="ECCERR12"/>
          <bitfield caption="Multiple Error in the page between the 3072nd and the 3327th Bytes" mask="0x00040000" name="MULERR12"/>
          <bitfield caption="Recoverable Error in the page between the 3328th and the 3583rd Bytes" mask="0x00100000" name="RECERR13"/>
          <bitfield caption="ECC Error in the page between the 3328th and the 3583rd Bytes" mask="0x00200000" name="ECCERR13"/>
          <bitfield caption="Multiple Error in the page between the 3328th and the 3583rd Bytes" mask="0x00400000" name="MULERR13"/>
          <bitfield caption="Recoverable Error in the page between the 3584th and the 3839th Bytes" mask="0x01000000" name="RECERR14"/>
          <bitfield caption="ECC Error in the page between the 3584th and the 3839th Bytes" mask="0x02000000" name="ECCERR14"/>
          <bitfield caption="Multiple Error in the page between the 3584th and the 3839th Bytes" mask="0x04000000" name="MULERR14"/>
          <bitfield caption="Recoverable Error in the page between the 3840th and the 4095th Bytes" mask="0x10000000" name="RECERR15"/>
          <bitfield caption="ECC Error in the page between the 3840th and the 4095th Bytes" mask="0x20000000" name="ECCERR15"/>
          <bitfield caption="Multiple Error in the page between the 3840th and the 4095th Bytes" mask="0x40000000" name="MULERR15"/>
        </register>
        <register caption="SMC ECC parity 2 Register" name="SMC_ECC_PR2" offset="0x038" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000FF8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x00FFF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 3 Register" name="SMC_ECC_PR3" offset="0x03C" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000FF8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x00FFF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 4 Register" name="SMC_ECC_PR4" offset="0x040" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000FF8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x00FFF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 5 Register" name="SMC_ECC_PR5" offset="0x044" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000FF8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x00FFF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 6 Register" name="SMC_ECC_PR6" offset="0x048" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000FF8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x00FFF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 7 Register" name="SMC_ECC_PR7" offset="0x04C" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000FF8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x00FFF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 8 Register" name="SMC_ECC_PR8" offset="0x050" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x000007F8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x007FF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 9 Register" name="SMC_ECC_PR9" offset="0x054" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x000007F8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x007FF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 10 Register" name="SMC_ECC_PR10" offset="0x058" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x000007F8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x007FF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 11 Register" name="SMC_ECC_PR11" offset="0x05C" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x000007F8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x007FF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 12 Register" name="SMC_ECC_PR12" offset="0x060" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x000007F8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x007FF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 13 Register" name="SMC_ECC_PR13" offset="0x064" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x000007F8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x007FF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 14 Register" name="SMC_ECC_PR14" offset="0x068" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x000007F8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x007FF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 15 Register" name="SMC_ECC_PR15" offset="0x06C" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x000007F8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x007FF000" name="NPARITY"/>
        </register>
        <register caption="PMECC Configuration Register" name="SMC_PMECCFG" offset="0x70" rw="RW" size="4">
          <bitfield caption="Error Correcting Capability" mask="0x00000007" name="BCH_ERR" values="SMC_PMECCFG__BCH_ERR"/>
          <bitfield caption="Sector Size" mask="0x00000010" name="SECTORSZ"/>
          <bitfield caption="Number of Sectors in the Page" mask="0x00000300" name="PAGESIZE" values="SMC_PMECCFG__PAGESIZE"/>
          <bitfield caption="NAND Write Access" mask="0x00001000" name="NANDWR"/>
          <bitfield caption="Spare Enable" mask="0x00010000" name="SPAREEN"/>
          <bitfield caption="Automatic Mode Enable" mask="0x00100000" name="AUTO"/>
        </register>
        <register caption="PMECC Spare Area Size Register" name="SMC_PMECCSAREA" offset="0x74" rw="RW" size="4">
          <bitfield caption="Spare Area Size" mask="0x000001FF" name="SPARESIZE"/>
        </register>
        <register caption="PMECC Start Address Register" name="SMC_PMECCSADDR" offset="0x78" rw="RW" size="4">
          <bitfield caption="ECC Area Start Address" mask="0x000001FF" name="STARTADDR"/>
        </register>
        <register caption="PMECC End Address Register" name="SMC_PMECCEADDR" offset="0x7C" rw="RW" size="4">
          <bitfield caption="ECC Area End Address" mask="0x000001FF" name="ENDADDR"/>
        </register>
        <register caption="PMECC Control Register" name="SMC_PMECCTRL" offset="0x84" rw="W" size="4">
          <bitfield caption="Reset the PMECC Module" mask="0x00000001" name="RST"/>
          <bitfield caption="Start a Data Phase" mask="0x00000002" name="DATA"/>
          <bitfield caption="Start a User Mode Phase" mask="0x00000004" name="USER"/>
          <bitfield caption="PMECC Enable" mask="0x00000010" name="ENABLE"/>
          <bitfield caption="PMECC Enable" mask="0x00000020" name="DISABLE"/>
        </register>
        <register caption="PMECC Status Register" name="SMC_PMECCSR" offset="0x88" rw="R" size="4">
          <bitfield caption="The kernel of the PMECC is busy" mask="0x00000001" name="BUSY"/>
          <bitfield caption="PMECC Enable bit" mask="0x00000010" name="ENABLE"/>
        </register>
        <register caption="PMECC Interrupt Enable register" name="SMC_PMECCIER" offset="0x8C" rw="W" size="4">
          <bitfield caption="Error Interrupt Enable" mask="0x00000001" name="ERRIE"/>
        </register>
        <register caption="PMECC Interrupt Disable Register" name="SMC_PMECCIDR" offset="0x90" rw="W" size="4">
          <bitfield caption="Error Interrupt Disable" mask="0x00000001" name="ERRID"/>
        </register>
        <register caption="PMECC Interrupt Mask Register" name="SMC_PMECCIMR" offset="0x94" rw="R" size="4">
          <bitfield caption="Error Interrupt Mask" mask="0x00000001" name="ERRIM"/>
        </register>
