MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D31.atdf
        <register caption="PMECC Error Location SIGMA 15 Register" name="SMC_SIGMA15" offset="0x564" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA15"/>
        </register>
        <register caption="PMECC Error Location SIGMA 16 Register" name="SMC_SIGMA16" offset="0x568" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA16"/>
        </register>
        <register caption="PMECC Error Location SIGMA 17 Register" name="SMC_SIGMA17" offset="0x56C" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA17"/>
        </register>
        <register caption="PMECC Error Location SIGMA 18 Register" name="SMC_SIGMA18" offset="0x570" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA18"/>
        </register>
        <register caption="PMECC Error Location SIGMA 19 Register" name="SMC_SIGMA19" offset="0x574" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA19"/>
        </register>
        <register caption="PMECC Error Location SIGMA 20 Register" name="SMC_SIGMA20" offset="0x578" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA20"/>
        </register>
        <register caption="PMECC Error Location SIGMA 21 Register" name="SMC_SIGMA21" offset="0x57C" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA21"/>
        </register>
        <register caption="PMECC Error Location SIGMA 22 Register" name="SMC_SIGMA22" offset="0x580" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA22"/>
        </register>
        <register caption="PMECC Error Location SIGMA 23 Register" name="SMC_SIGMA23" offset="0x584" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA23"/>
        </register>
        <register caption="PMECC Error Location SIGMA 24 Register" name="SMC_SIGMA24" offset="0x588" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA24"/>
        </register>
        <register caption="PMECC Error Location 0 Register 0" name="SMC_ERRLOC0" offset="0x58C" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 1" name="SMC_ERRLOC1" offset="0x590" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 2" name="SMC_ERRLOC2" offset="0x594" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 3" name="SMC_ERRLOC3" offset="0x598" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 4" name="SMC_ERRLOC4" offset="0x59C" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 5" name="SMC_ERRLOC5" offset="0x5A0" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 6" name="SMC_ERRLOC6" offset="0x5A4" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 7" name="SMC_ERRLOC7" offset="0x5A8" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 8" name="SMC_ERRLOC8" offset="0x5AC" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 9" name="SMC_ERRLOC9" offset="0x5B0" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 10" name="SMC_ERRLOC10" offset="0x5B4" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 11" name="SMC_ERRLOC11" offset="0x5B8" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 12" name="SMC_ERRLOC12" offset="0x5BC" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 13" name="SMC_ERRLOC13" offset="0x5C0" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
