MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D31.atdf
        <register caption="PMECC Error Location 0 Register 14" name="SMC_ERRLOC14" offset="0x5C4" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 15" name="SMC_ERRLOC15" offset="0x5C8" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 16" name="SMC_ERRLOC16" offset="0x5CC" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 17" name="SMC_ERRLOC17" offset="0x5D0" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 18" name="SMC_ERRLOC18" offset="0x5D4" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 19" name="SMC_ERRLOC19" offset="0x5D8" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 20" name="SMC_ERRLOC20" offset="0x5DC" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 21" name="SMC_ERRLOC21" offset="0x5E0" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 22" name="SMC_ERRLOC22" offset="0x5E4" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="PMECC Error Location 0 Register 23" name="SMC_ERRLOC23" offset="0x5E8" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register caption="SMC Setup Register (CS_number = 0)" name="SMC_SETUP0" offset="0x600" rw="RW" size="4">
          <bitfield caption="NWE Setup Length" mask="0x0000003F" name="NWE_SETUP"/>
          <bitfield caption="NCS Setup Length in Write Access" mask="0x00003F00" name="NCS_WR_SETUP"/>
          <bitfield caption="NRD Setup Length" mask="0x003F0000" name="NRD_SETUP"/>
          <bitfield caption="NCS Setup Length in Read Access" mask="0x3F000000" name="NCS_RD_SETUP"/>
        </register>
        <register caption="SMC Pulse Register (CS_number = 0)" name="SMC_PULSE0" offset="0x604" rw="RW" size="4">
          <bitfield caption="NWE Pulse Length" mask="0x0000003F" name="NWE_PULSE"/>
          <bitfield caption="NCS Pulse Length in WRITE Access" mask="0x00003F00" name="NCS_WR_PULSE"/>
          <bitfield caption="NRD Pulse Length" mask="0x003F0000" name="NRD_PULSE"/>
          <bitfield caption="NCS Pulse Length in READ Access" mask="0x3F000000" name="NCS_RD_PULSE"/>
        </register>
        <register caption="SMC Cycle Register (CS_number = 0)" name="SMC_CYCLE0" offset="0x608" rw="RW" size="4">
          <bitfield caption="Total Write Cycle Length" mask="0x000001FF" name="NWE_CYCLE"/>
          <bitfield caption="Total Read Cycle Length" mask="0x01FF0000" name="NRD_CYCLE"/>
        </register>
        <register caption="SMC Timings Register (CS_number = 0)" name="SMC_TIMINGS0" offset="0x60C" rw="RW" size="4">
          <bitfield caption="CLE to REN Low Delay" mask="0x0000000F" name="TCLR"/>
          <bitfield caption="ALE to Data Start" mask="0x000000F0" name="TADL"/>
          <bitfield caption="ALE to REN Low Delay" mask="0x00000F00" name="TAR"/>
          <bitfield caption="Off Chip Memory Scrambling Enable" mask="0x00001000" name="OCMS"/>
          <bitfield caption="Ready to REN Low Delay" mask="0x000F0000" name="TRR"/>
          <bitfield caption="WEN High to REN to Busy" mask="0x0F000000" name="TWB"/>
          <bitfield caption="Ready/Busy Line Selection" mask="0x70000000" name="RBNSEL"/>
          <bitfield caption="NAND Flash Selection" mask="0x80000000" name="NFSEL"/>
        </register>
        <register caption="SMC Mode Register (CS_number = 0)" name="SMC_MODE0" offset="0x610" rw="RW" size="4">
          <bitfield caption="" mask="0x00000001" name="READ_MODE" values="SMC_MODE0__READ_MODE"/>
          <bitfield caption="" mask="0x00000002" name="WRITE_MODE" values="SMC_MODE0__WRITE_MODE"/>
          <bitfield caption="NWAIT Mode" mask="0x00000030" name="EXNW_MODE" values="SMC_MODE0__EXNW_MODE"/>
          <bitfield caption="Byte Access Type" mask="0x00000100" name="BAT"/>
          <bitfield caption="Data Bus Width" mask="0x00001000" name="DBW" values="SMC_MODE0__DBW"/>
          <bitfield caption="Data Float Time" mask="0x000F0000" name="TDF_CYCLES"/>
          <bitfield caption="TDF Optimization" mask="0x00100000" name="TDF_MODE"/>
        </register>
        <register caption="SMC Setup Register (CS_number = 1)" name="SMC_SETUP1" offset="0x614" rw="RW" size="4">
          <bitfield caption="NWE Setup Length" mask="0x0000003F" name="NWE_SETUP"/>
          <bitfield caption="NCS Setup Length in Write Access" mask="0x00003F00" name="NCS_WR_SETUP"/>
          <bitfield caption="NRD Setup Length" mask="0x003F0000" name="NRD_SETUP"/>
          <bitfield caption="NCS Setup Length in Read Access" mask="0x3F000000" name="NCS_RD_SETUP"/>
        </register>
        <register caption="SMC Pulse Register (CS_number = 1)" name="SMC_PULSE1" offset="0x618" rw="RW" size="4">
          <bitfield caption="NWE Pulse Length" mask="0x0000003F" name="NWE_PULSE"/>
          <bitfield caption="NCS Pulse Length in WRITE Access" mask="0x00003F00" name="NCS_WR_PULSE"/>
          <bitfield caption="NRD Pulse Length" mask="0x003F0000" name="NRD_PULSE"/>
          <bitfield caption="NCS Pulse Length in READ Access" mask="0x3F000000" name="NCS_RD_PULSE"/>
        </register>
        <register caption="SMC Cycle Register (CS_number = 1)" name="SMC_CYCLE1" offset="0x61C" rw="RW" size="4">
          <bitfield caption="Total Write Cycle Length" mask="0x000001FF" name="NWE_CYCLE"/>
          <bitfield caption="Total Read Cycle Length" mask="0x01FF0000" name="NRD_CYCLE"/>
        </register>
        <register caption="SMC Timings Register (CS_number = 1)" name="SMC_TIMINGS1" offset="0x620" rw="RW" size="4">
          <bitfield caption="CLE to REN Low Delay" mask="0x0000000F" name="TCLR"/>
          <bitfield caption="ALE to Data Start" mask="0x000000F0" name="TADL"/>
          <bitfield caption="ALE to REN Low Delay" mask="0x00000F00" name="TAR"/>
          <bitfield caption="Off Chip Memory Scrambling Enable" mask="0x00001000" name="OCMS"/>
          <bitfield caption="Ready to REN Low Delay" mask="0x000F0000" name="TRR"/>
          <bitfield caption="WEN High to REN to Busy" mask="0x0F000000" name="TWB"/>
          <bitfield caption="Ready/Busy Line Selection" mask="0x70000000" name="RBNSEL"/>
          <bitfield caption="NAND Flash Selection" mask="0x80000000" name="NFSEL"/>
        </register>
        <register caption="SMC Mode Register (CS_number = 1)" name="SMC_MODE1" offset="0x624" rw="RW" size="4">
          <bitfield caption="" mask="0x00000001" name="READ_MODE" values="SMC_MODE1__READ_MODE"/>
          <bitfield caption="" mask="0x00000002" name="WRITE_MODE" values="SMC_MODE1__WRITE_MODE"/>
          <bitfield caption="NWAIT Mode" mask="0x00000030" name="EXNW_MODE" values="SMC_MODE1__EXNW_MODE"/>
          <bitfield caption="Byte Access Type" mask="0x00000100" name="BAT"/>
          <bitfield caption="Data Bus Width" mask="0x00001000" name="DBW" values="SMC_MODE1__DBW"/>
          <bitfield caption="Data Float Time" mask="0x000F0000" name="TDF_CYCLES"/>
          <bitfield caption="TDF Optimization" mask="0x00100000" name="TDF_MODE"/>
        </register>
        <register caption="SMC Setup Register (CS_number = 2)" name="SMC_SETUP2" offset="0x628" rw="RW" size="4">
          <bitfield caption="NWE Setup Length" mask="0x0000003F" name="NWE_SETUP"/>
          <bitfield caption="NCS Setup Length in Write Access" mask="0x00003F00" name="NCS_WR_SETUP"/>
          <bitfield caption="NRD Setup Length" mask="0x003F0000" name="NRD_SETUP"/>
          <bitfield caption="NCS Setup Length in Read Access" mask="0x3F000000" name="NCS_RD_SETUP"/>
        </register>
        <register caption="SMC Pulse Register (CS_number = 2)" name="SMC_PULSE2" offset="0x62C" rw="RW" size="4">
          <bitfield caption="NWE Pulse Length" mask="0x0000003F" name="NWE_PULSE"/>
          <bitfield caption="NCS Pulse Length in WRITE Access" mask="0x00003F00" name="NCS_WR_PULSE"/>
          <bitfield caption="NRD Pulse Length" mask="0x003F0000" name="NRD_PULSE"/>
          <bitfield caption="NCS Pulse Length in READ Access" mask="0x3F000000" name="NCS_RD_PULSE"/>
        </register>
        <register caption="SMC Cycle Register (CS_number = 2)" name="SMC_CYCLE2" offset="0x630" rw="RW" size="4">
          <bitfield caption="Total Write Cycle Length" mask="0x000001FF" name="NWE_CYCLE"/>
          <bitfield caption="Total Read Cycle Length" mask="0x01FF0000" name="NRD_CYCLE"/>
        </register>
