MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D31.atdf
        <register caption="Transmit Holding Register" name="TWI_THR" offset="0x34" rw="W" size="4">
          <bitfield caption="Master or Slave Transmit Holding Data" mask="0x000000FF" name="TXDATA"/>
        </register>
        <register caption="Protection Mode Register" name="TWI_WPROT_MODE" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write protection bit" mask="0x00000001" name="WPROT"/>
          <bitfield caption="Write protection mode security code" mask="0xFFFFFF00" name="SECURITY_CODE"/>
        </register>
        <register caption="Protection Status Register" name="TWI_WPROT_STATUS" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Error" mask="0x00000001" name="WPROTERR"/>
          <bitfield caption="Write Protection Error Address" mask="0xFFFFFF00" name="WPROTADDR"/>
        </register>
      </register-group>
      <value-group caption="" name="TWI_MMR__IADRSZ">
        <value caption="No internal device address" name="NONE" value="0x0"/>
        <value caption="One-byte internal device address" name="_1_BYTE" value="0x1"/>
        <value caption="Two-byte internal device address" name="_2_BYTE" value="0x2"/>
        <value caption="Three-byte internal device address" name="_3_BYTE" value="0x3"/>
      </value-group>
    </module>
    <module caption="Universal Asynchronous Receiver Transmitter" name="UART" version="6418E">
      <register-group name="UART">
        <register caption="Control Register" name="UART_CR" offset="0x0000" rw="W" size="4">
          <bitfield caption="Reset Receiver" mask="0x00000004" name="RSTRX"/>
          <bitfield caption="Reset Transmitter" mask="0x00000008" name="RSTTX"/>
          <bitfield caption="Receiver Enable" mask="0x00000010" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000020" name="RXDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000040" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000080" name="TXDIS"/>
          <bitfield caption="Reset Status Bits" mask="0x00000100" name="RSTSTA"/>
        </register>
        <register caption="Mode Register" name="UART_MR" offset="0x0004" rw="RW" size="4">
          <bitfield caption="Parity Type" mask="0x00000E00" name="PAR" values="UART_MR__PAR"/>
          <bitfield caption="Channel Mode" mask="0x0000C000" name="CHMODE" values="UART_MR__CHMODE"/>
        </register>
        <register caption="Interrupt Enable Register" name="UART_IER" offset="0x0008" rw="W" size="4">
          <bitfield caption="Enable RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Enable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Enable Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Enable Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Enable Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Enable TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
        </register>
        <register caption="Interrupt Disable Register" name="UART_IDR" offset="0x000C" rw="W" size="4">
          <bitfield caption="Disable RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Disable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Disable Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Disable Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Disable Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Disable TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
        </register>
        <register caption="Interrupt Mask Register" name="UART_IMR" offset="0x0010" rw="R" size="4">
          <bitfield caption="Mask RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Disable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Mask Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Mask Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Mask Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Mask TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
        </register>
        <register caption="Status Register" name="UART_SR" offset="0x0014" rw="R" size="4">
          <bitfield caption="Receiver Ready" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Transmitter Ready" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Overrun Error" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error" mask="0x00000080" name="PARE"/>
          <bitfield caption="Transmitter Empty" mask="0x00000200" name="TXEMPTY"/>
        </register>
        <register caption="Receive Holding Register" name="UART_RHR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Received Character" mask="0x000000FF" name="RXCHR"/>
        </register>
        <register caption="Transmit Holding Register" name="UART_THR" offset="0x001C" rw="W" size="4">
          <bitfield caption="Character to be Transmitted" mask="0x000000FF" name="TXCHR"/>
        </register>
        <register caption="Baud Rate Generator Register" name="UART_BRGR" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Clock Divisor" mask="0x0000FFFF" name="CD"/>
        </register>
      </register-group>
      <value-group caption="" name="UART_MR__PAR">
        <value caption="Even parity" name="EVEN" value="0x0"/>
        <value caption="Odd parity" name="ODD" value="0x1"/>
        <value caption="Space: parity forced to 0" name="SPACE" value="0x2"/>
        <value caption="Mark: parity forced to 1" name="MARK" value="0x3"/>
        <value caption="No parity" name="NO" value="0x4"/>
      </value-group>
