MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D31.atdf
        <register caption="UDPHS Endpoint Status Register (endpoint = 15)" name="UDPHS_EPTSTA15" offset="0x2FC" rw="R" size="4">
          <bitfield caption="Stall Handshake Request" mask="0x00000020" name="FRCESTALL"/>
          <bitfield caption="Toggle Sequencing" mask="0x000000C0" name="TOGGLESQ_STA" values="UDPHS_EPTSTA15__TOGGLESQ_STA"/>
          <bitfield caption="Overflow Error" mask="0x00000100" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data/KILL Bank" mask="0x00000200" name="RX_BK_RDY"/>
          <bitfield caption="Received OUT Data/KILL Bank" mask="0x00000200" name="KILL_BANK"/>
          <bitfield caption="Transmitted IN Data Complete" mask="0x00000400" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready/Transaction Error" mask="0x00000800" name="TX_PK_RDY"/>
          <bitfield caption="TX Packet Ready/Transaction Error" mask="0x00000800" name="ERR_TRANS"/>
          <bitfield caption="Received SETUP/Error Flow" mask="0x00001000" name="RX_SETUP"/>
          <bitfield caption="Received SETUP/Error Flow" mask="0x00001000" name="ERR_FL_ISO"/>
          <bitfield caption="Stall Sent/CRC ISO Error/Number of Transaction Error" mask="0x00002000" name="STALL_SNT"/>
          <bitfield caption="Stall Sent/CRC ISO Error/Number of Transaction Error" mask="0x00002000" name="ERR_CRISO"/>
          <bitfield caption="Stall Sent/CRC ISO Error/Number of Transaction Error" mask="0x00002000" name="ERR_NBTRA"/>
          <bitfield caption="NAK IN/Bank Flush Error" mask="0x00004000" name="NAK_IN"/>
          <bitfield caption="NAK IN/Bank Flush Error" mask="0x00004000" name="ERR_FLUSH"/>
          <bitfield caption="NAK OUT" mask="0x00008000" name="NAK_OUT"/>
          <bitfield caption="Current Bank/Control Direction" mask="0x00030000" name="CURRENT_BANK"/>
          <bitfield caption="Current Bank/Control Direction" mask="0x00030000" name="CONTROL_DIR"/>
          <bitfield caption="Busy Bank Number" mask="0x000C0000" name="BUSY_BANK_STA" values="UDPHS_EPTSTA15__BUSY_BANK_STA"/>
          <bitfield caption="UDPHS Byte Count" mask="0x7FF00000" name="BYTE_COUNT"/>
          <bitfield caption="Short Packet" mask="0x80000000" name="SHRT_PCKT"/>
        </register>
        <register caption="UDPHS DMA Next Descriptor Address Register (channel = 0)" name="UDPHS_DMANXTDSC0" offset="0x300" rw="RW" size="4">
          <bitfield caption="" mask="0xFFFFFFFF" name="NXT_DSC_ADD"/>
        </register>
        <register caption="UDPHS DMA Channel Address Register (channel = 0)" name="UDPHS_DMAADDRESS0" offset="0x304" rw="RW" size="4">
          <bitfield caption="" mask="0xFFFFFFFF" name="BUFF_ADD"/>
        </register>
        <register caption="UDPHS DMA Channel Control Register (channel = 0)" name="UDPHS_DMACONTROL0" offset="0x308" rw="RW" size="4">
          <bitfield caption="" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Load Next Channel Transfer Descriptor Enable (Command)" mask="0x00000002" name="LDNXT_DSC"/>
          <bitfield caption="End of Transfer Enable (Control)" mask="0x00000004" name="END_TR_EN"/>
          <bitfield caption="End of Buffer Enable (Control)" mask="0x00000008" name="END_B_EN"/>
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000010" name="END_TR_IT"/>
          <bitfield caption="End of Buffer Interrupt Enable" mask="0x00000020" name="END_BUFFIT"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000040" name="DESC_LD_IT"/>
          <bitfield caption="Burst Lock Enable" mask="0x00000080" name="BURST_LCK"/>
          <bitfield caption="Buffer Byte Length (Write-only)" mask="0xFFFF0000" name="BUFF_LENGTH"/>
        </register>
        <register caption="UDPHS DMA Channel Status Register (channel = 0)" name="UDPHS_DMASTATUS0" offset="0x30C" rw="RW" size="4">
          <bitfield caption="Channel Enable Status" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Channel Active Status" mask="0x00000002" name="CHANN_ACT"/>
          <bitfield caption="End of Channel Transfer Status" mask="0x00000010" name="END_TR_ST"/>
          <bitfield caption="End of Channel Buffer Status" mask="0x00000020" name="END_BF_ST"/>
          <bitfield caption="Descriptor Loaded Status" mask="0x00000040" name="DESC_LDST"/>
          <bitfield caption="Buffer Byte Count" mask="0xFFFF0000" name="BUFF_COUNT"/>
        </register>
        <register caption="UDPHS DMA Next Descriptor Address Register (channel = 1)" name="UDPHS_DMANXTDSC1" offset="0x310" rw="RW" size="4">
          <bitfield caption="" mask="0xFFFFFFFF" name="NXT_DSC_ADD"/>
        </register>
        <register caption="UDPHS DMA Channel Address Register (channel = 1)" name="UDPHS_DMAADDRESS1" offset="0x314" rw="RW" size="4">
          <bitfield caption="" mask="0xFFFFFFFF" name="BUFF_ADD"/>
        </register>
        <register caption="UDPHS DMA Channel Control Register (channel = 1)" name="UDPHS_DMACONTROL1" offset="0x318" rw="RW" size="4">
          <bitfield caption="" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Load Next Channel Transfer Descriptor Enable (Command)" mask="0x00000002" name="LDNXT_DSC"/>
          <bitfield caption="End of Transfer Enable (Control)" mask="0x00000004" name="END_TR_EN"/>
          <bitfield caption="End of Buffer Enable (Control)" mask="0x00000008" name="END_B_EN"/>
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000010" name="END_TR_IT"/>
          <bitfield caption="End of Buffer Interrupt Enable" mask="0x00000020" name="END_BUFFIT"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000040" name="DESC_LD_IT"/>
          <bitfield caption="Burst Lock Enable" mask="0x00000080" name="BURST_LCK"/>
          <bitfield caption="Buffer Byte Length (Write-only)" mask="0xFFFF0000" name="BUFF_LENGTH"/>
        </register>
        <register caption="UDPHS DMA Channel Status Register (channel = 1)" name="UDPHS_DMASTATUS1" offset="0x31C" rw="RW" size="4">
          <bitfield caption="Channel Enable Status" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Channel Active Status" mask="0x00000002" name="CHANN_ACT"/>
          <bitfield caption="End of Channel Transfer Status" mask="0x00000010" name="END_TR_ST"/>
          <bitfield caption="End of Channel Buffer Status" mask="0x00000020" name="END_BF_ST"/>
          <bitfield caption="Descriptor Loaded Status" mask="0x00000040" name="DESC_LDST"/>
          <bitfield caption="Buffer Byte Count" mask="0xFFFF0000" name="BUFF_COUNT"/>
        </register>
        <register caption="UDPHS DMA Next Descriptor Address Register (channel = 2)" name="UDPHS_DMANXTDSC2" offset="0x320" rw="RW" size="4">
          <bitfield caption="" mask="0xFFFFFFFF" name="NXT_DSC_ADD"/>
        </register>
        <register caption="UDPHS DMA Channel Address Register (channel = 2)" name="UDPHS_DMAADDRESS2" offset="0x324" rw="RW" size="4">
          <bitfield caption="" mask="0xFFFFFFFF" name="BUFF_ADD"/>
        </register>
