MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D31.atdf
      <value-group caption="" name="UDPHS_EPTSTA2__BUSY_BANK_STA">
        <value caption="1 busy bank" name="_1BUSYBANK" value="0x0"/>
        <value caption="2 busy banks" name="_2BUSYBANKS" value="0x1"/>
        <value caption="3 busy banks" name="_3BUSYBANKS" value="0x2"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTCFG3__EPT_SIZE">
        <value caption="8 bytes" name="_8" value="0x0"/>
        <value caption="16 bytes" name="_16" value="0x1"/>
        <value caption="32 bytes" name="_32" value="0x2"/>
        <value caption="64 bytes" name="_64" value="0x3"/>
        <value caption="128 bytes" name="_128" value="0x4"/>
        <value caption="256 bytes" name="_256" value="0x5"/>
        <value caption="512 bytes" name="_512" value="0x6"/>
        <value caption="1024 bytes" name="_1024" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTCFG3__EPT_TYPE">
        <value caption="Control endpoint" name="CTRL8" value="0x0"/>
        <value caption="Isochronous endpoint" name="ISO" value="0x1"/>
        <value caption="Bulk endpoint" name="BULK" value="0x2"/>
        <value caption="Interrupt endpoint" name="INT" value="0x3"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTCFG3__BK_NUMBER">
        <value caption="Zero bank, the endpoint is not mapped in memory" name="_0" value="0x0"/>
        <value caption="One bank (bank 0)" name="_1" value="0x1"/>
        <value caption="Double bank (Ping-Pong: bank0/bank1)" name="_2" value="0x2"/>
        <value caption="Triple bank (bank0/bank1/bank2)" name="_3" value="0x3"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTSTA3__TOGGLESQ_STA">
        <value caption="DATA0" name="DATA0" value="0x0"/>
        <value caption="DATA1" name="DATA1" value="0x1"/>
        <value caption="Data2 (only for High Bandwidth Isochronous Endpoint)" name="DATA2" value="0x2"/>
        <value caption="MData (only for High Bandwidth Isochronous Endpoint)" name="MDATA" value="0x3"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTSTA3__BUSY_BANK_STA">
        <value caption="1 busy bank" name="_1BUSYBANK" value="0x0"/>
        <value caption="2 busy banks" name="_2BUSYBANKS" value="0x1"/>
        <value caption="3 busy banks" name="_3BUSYBANKS" value="0x2"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTCFG4__EPT_SIZE">
        <value caption="8 bytes" name="_8" value="0x0"/>
        <value caption="16 bytes" name="_16" value="0x1"/>
        <value caption="32 bytes" name="_32" value="0x2"/>
        <value caption="64 bytes" name="_64" value="0x3"/>
        <value caption="128 bytes" name="_128" value="0x4"/>
        <value caption="256 bytes" name="_256" value="0x5"/>
        <value caption="512 bytes" name="_512" value="0x6"/>
        <value caption="1024 bytes" name="_1024" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTCFG4__EPT_TYPE">
        <value caption="Control endpoint" name="CTRL8" value="0x0"/>
        <value caption="Isochronous endpoint" name="ISO" value="0x1"/>
        <value caption="Bulk endpoint" name="BULK" value="0x2"/>
        <value caption="Interrupt endpoint" name="INT" value="0x3"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTCFG4__BK_NUMBER">
        <value caption="Zero bank, the endpoint is not mapped in memory" name="_0" value="0x0"/>
        <value caption="One bank (bank 0)" name="_1" value="0x1"/>
        <value caption="Double bank (Ping-Pong: bank0/bank1)" name="_2" value="0x2"/>
        <value caption="Triple bank (bank0/bank1/bank2)" name="_3" value="0x3"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTSTA4__TOGGLESQ_STA">
        <value caption="DATA0" name="DATA0" value="0x0"/>
        <value caption="DATA1" name="DATA1" value="0x1"/>
        <value caption="Data2 (only for High Bandwidth Isochronous Endpoint)" name="DATA2" value="0x2"/>
        <value caption="MData (only for High Bandwidth Isochronous Endpoint)" name="MDATA" value="0x3"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTSTA4__BUSY_BANK_STA">
        <value caption="1 busy bank" name="_1BUSYBANK" value="0x0"/>
        <value caption="2 busy banks" name="_2BUSYBANKS" value="0x1"/>
        <value caption="3 busy banks" name="_3BUSYBANKS" value="0x2"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTCFG5__EPT_SIZE">
        <value caption="8 bytes" name="_8" value="0x0"/>
        <value caption="16 bytes" name="_16" value="0x1"/>
        <value caption="32 bytes" name="_32" value="0x2"/>
        <value caption="64 bytes" name="_64" value="0x3"/>
        <value caption="128 bytes" name="_128" value="0x4"/>
        <value caption="256 bytes" name="_256" value="0x5"/>
        <value caption="512 bytes" name="_512" value="0x6"/>
        <value caption="1024 bytes" name="_1024" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTCFG5__EPT_TYPE">
        <value caption="Control endpoint" name="CTRL8" value="0x0"/>
        <value caption="Isochronous endpoint" name="ISO" value="0x1"/>
        <value caption="Bulk endpoint" name="BULK" value="0x2"/>
        <value caption="Interrupt endpoint" name="INT" value="0x3"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTCFG5__BK_NUMBER">
        <value caption="Zero bank, the endpoint is not mapped in memory" name="_0" value="0x0"/>
        <value caption="One bank (bank 0)" name="_1" value="0x1"/>
        <value caption="Double bank (Ping-Pong: bank0/bank1)" name="_2" value="0x2"/>
        <value caption="Triple bank (bank0/bank1/bank2)" name="_3" value="0x3"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTSTA5__TOGGLESQ_STA">
        <value caption="DATA0" name="DATA0" value="0x0"/>
        <value caption="DATA1" name="DATA1" value="0x1"/>
        <value caption="Data2 (only for High Bandwidth Isochronous Endpoint)" name="DATA2" value="0x2"/>
        <value caption="MData (only for High Bandwidth Isochronous Endpoint)" name="MDATA" value="0x3"/>
      </value-group>
